{"id": "ex_0126", "required_agents": [0, 1, 2, 3, 4, 5, 7], "difficulty": 6, "eval_hint": "код + SQL + анализ + мат + JSON + резюме + стиль", "text": "Разработай систему для анализа пользовательского поведения на сайте: создай модули сбора и обработки веб-аналитики, загружай данные о сессиях и конверсиях из базы, реализуй модели предсказания оттока пользователей, примени статистические методы для сегментации аудитории, структурируй персоны пользователей, сформируй краткие инсайты для продуктовой команды и адаптируй рекомендации по улучшению UX для дизайнеров.", "notes": "Code для системы, SQL для загрузки, Data Analysis для оттока, Math для сегментации, Structured Extraction для персон, Summarization для инсайтов, Rewrite для дизайнеров."}
{"id": "ex_0174", "required_agents": [6, 8], "difficulty": 1, "eval_hint": "ТЗ + финансы", "text": "Опиши требования к модулю учёта расходов и добавь пример расчёта категорий затрат.", "notes": "Requirements для модуля + Finance для расходов."}
{"id": "ex_0052", "required_agents": [1, 3, 6, 7], "difficulty": 3, "eval_hint": "SQL + мат + ТЗ + стиль", "text": "Извлеки метрики SLA из базы мониторинга, вычисли процент выполнения по периодам, составь требования к улучшению сервиса и переформулируй для клиентского портала.", "notes": "SQL для метрик, Math для вычислений, Requirements для улучшения, Rewrite для портала."}
{"id": "ex_0098", "required_agents": [0, 1, 3, 4, 5, 7], "difficulty": 5, "eval_hint": "код + SQL + мат + JSON + резюме + стиль", "text": "Создай инструмент для анализа тестовых данных: загружай результаты из базы, примени статистические тесты для проверки гипотез, структурируй выводы по экспериментам, сформируй краткие отчёты и адаптируй их для презентации команде разработки.", "notes": "Code для инструмента, SQL для загрузки, Math для тестов, Structured Extraction для выводов, Summarization для отчётов, Rewrite для команды."}
{"id": "ex_0003", "required_agents": [3, 8], "difficulty": 1, "eval_hint": "формулы + финансы", "text": "Рассчитай ежемесячный платёж по ипотеке на 5 млн под 12% годовых на 20 лет, используя формулу аннуитета.", "notes": "Math для формул + Finance для финансовых расчётов."}
{"id": "ex_0317", "required_agents": [0, 1, 3, 4, 5, 6, 7, 8], "difficulty": 7, "eval_hint": "код + SQL + мат + JSON + резюме + ТЗ + стиль + финансы", "text": "Создай систему для автоматизации процесса IFRS 9 в банке: разработай модули для расчёта ECL по всем стадиям, интегрируй с кредитными системами для получения exposure, реализуй PD/LGD/EAD модели с использованием ML, вычисли lifetime expected credit losses, проанализируй качество кредитного портфеля и staging, структурируй disclosure требования, генерируй quarterly IFRS reports, составь методологию в соответствии со стандартом, адаптируй отчётность для аудиторов и регулятора и рассчитай impact на капитал.", "notes": "Code для системы, SQL для exposure, Math для ML моделей, Structured Extraction для disclosure, Summarization для reports, Requirements для методологии, Rewrite для аудиторов, Finance для impact."}
{"id": "ex_0036", "required_agents": [0, 2, 6, 7], "difficulty": 3, "eval_hint": "код + анализ + ТЗ + стиль", "text": "Напиши библиотеку для визуализации метрик, реализуй анализ трендов, составь руководство по использованию и адаптируй примеры для разных уровней пользователей.", "notes": "Code для библиотеки, Data Analysis для трендов, Requirements для руководства, Rewrite для адаптации."}
{"id": "ex_0101", "required_agents": [0, 1, 2, 5, 7, 8], "difficulty": 5, "eval_hint": "код + SQL + анализ + резюме + стиль + финансы", "text": "Создай автоматизированный отчёт о движении денежных средств: выгружай транзакции из учётной системы, реализуй классификацию по видам деятельности, проанализируй кэш-флоу, сформируй краткие саммари для CFO, адаптируй отчёт для совета директоров и рассчитай чистый денежный поток.", "notes": "Code для отчёта, SQL для транзакций, Data Analysis для кэш-флоу, Summarization для саммари, Rewrite для совета, Finance для потока."}
{"id": "ex_0211", "required_agents": [0, 1, 2, 5], "difficulty": 3, "eval_hint": "код + SQL + анализ + резюме", "text": "Создай систему для мониторинга качества данных: загружай таблицы из базы, реализуй проверки консистентности, анализируй найденные проблемы и генерируй ежедневные отчёты для администраторов.", "notes": "Code для системы, SQL для загрузки, Data Analysis для проблем, Summarization для отчётов."}
{"id": "ex_0245", "required_agents": [2, 3, 4, 6, 8], "difficulty": 4, "eval_hint": "анализ + мат + JSON + ТЗ + финансы", "text": "Проанализируй эффективность инвестиционных проектов: обработай данные о денежных потоках, вычисли NPV и IRR, структурируй рейтинг проектов, составь требования к процессу отбора и рассчитай период окупаемости.", "notes": "Data Analysis для потоков, Math для NPV/IRR, Structured Extraction для рейтинга, Requirements для отбора, Finance для окупаемости."}
{"id": "ex_0318", "required_agents": [0, 1, 2, 3, 4, 5, 6, 8], "difficulty": 7, "eval_hint": "код + SQL + анализ + мат + JSON + резюме + ТЗ + финансы", "text": "Разработай платформу для комплексного fund management: создай модули для portfolio construction и optimization, загружай market data и holdings, реализуй factor models и risk attribution, вычисли tracking error и information ratio, проанализируй performance vs benchmark, структурируй trade recommendations, генерируй monthly performance reports, составь требования к order management и execution и рассчитай transaction costs и slippage.", "notes": "Code для платформы, SQL для data, Data Analysis для performance, Math для factor models, Structured Extraction для recommendations, Summarization для reports, Requirements для execution, Finance для costs."}
{"id": "ex_0218", "required_agents": [3, 4, 5, 6], "difficulty": 3, "eval_hint": "мат + JSON + резюме + ТЗ", "text": "Реши задачу многокритериальной оптимизации, структурируй варианты решений, подготовь краткое резюме и составь рекомендации по выбору.", "notes": "Math для оптимизации, Structured Extraction для вариантов, Summarization для резюме, Requirements для рекомендаций."}
{"id": "ex_0293", "required_agents": [0, 1, 3, 5, 6, 8], "difficulty": 5, "eval_hint": "код + SQL + мат + резюме + ТЗ + финансы", "text": "Создай систему для расчёта пенсионных обязательств: интегрируй с базой сотрудников, реализуй актуарные вычисления, вычисли дисконтированную стоимость обязательств, сформируй краткие отчёты для HR, составь требования к учёту по МСФО и рассчитай необходимые резервы.", "notes": "Code для системы, SQL для интеграции, Math для актуарных расчётов, Summarization для отчётов, Requirements для МСФО, Finance для резервов."}
{"id": "ex_0105", "required_agents": [0, 1, 2, 4, 5, 8], "difficulty": 5, "eval_hint": "код + SQL + анализ + JSON + резюме + финансы", "text": "Разработай систему для расчёта бонусов сотрудников: загружай KPI из базы, реализуй алгоритмы начисления премий, обработай метрики выполнения целей, структурируй персональные отчёты, генерируй краткие саммари для HR и рассчитай общий фонд оплаты труда.", "notes": "Code для системы, SQL для KPI, Data Analysis для метрик, Structured Extraction для отчётов, Summarization для HR, Finance для фонда."}
{"id": "ex_0011", "required_agents": [2, 3, 8], "difficulty": 2, "eval_hint": "анализ + мат + финансы", "text": "Вычисли NPV для проекта с инвестициями 10 млн и денежными потоками по годам, проанализируй чувствительность к ставке дисконтирования.", "notes": "Data Analysis для обработки, Math для формул NPV, Finance для финансовых показателей."}
{"id": "ex_0198", "required_agents": [1, 2, 5], "difficulty": 2, "eval_hint": "SQL + анализ + резюме", "text": "Выполни запрос по логам ошибок, проанализируй частоту различных типов и составь краткий отчёт для разработчиков.", "notes": "SQL для запроса, Data Analysis для частоты, Summarization для отчёта."}
{"id": "ex_0235", "required_agents": [2, 3, 6, 8], "difficulty": 3, "eval_hint": "анализ + мат + ТЗ + финансы", "text": "Обработай данные о затратах на маркетинг, вычисли эффективность каждого канала, составь требования к оптимизации бюджета и рассчитай ROI.", "notes": "Data Analysis для затрат, Math для эффективности, Requirements для оптимизации, Finance для ROI."}
{"id": "ex_0040", "required_agents": [2, 5, 6, 7], "difficulty": 3, "eval_hint": "анализ + резюме + ТЗ + стиль", "text": "Исследуй метрики вовлечённости пользователей, выдели ключевые инсайты, сформулируй требования к продуктовым улучшениям и подготовь презентацию для инвесторов.", "notes": "Data Analysis для метрик, Summarization для инсайтов, Requirements для улучшений, Rewrite для презентации."}
{"id": "ex_0119", "required_agents": [1, 2, 4, 5, 6, 7, 8], "difficulty": 6, "eval_hint": "SQL + анализ + JSON + резюме + ТЗ + стиль + финансы", "text": "Выгрузи детальные данные о работе call-центра и продажах по каналам, проанализируй конверсию на каждом этапе воронки, структурируй метрики эффективности по операторам и продуктам, подготовь развёрнутый отчёт для коммерческого директора, составь требования к системе мотивации сотрудников, адаптируй KPI под разные команды и рассчитай стоимость привлечения клиента по каждому каналу.", "notes": "SQL для выгрузки, Data Analysis для конверсии, Structured Extraction для метрик, Summarization для отчёта, Requirements для мотивации, Rewrite для команд, Finance для CAC."}
{"id": "ex_0320", "required_agents": [1, 2, 3, 4, 5, 6, 7, 8], "difficulty": 7, "eval_hint": "SQL + анализ + мат + JSON + резюме + ТЗ + стиль + финансы", "text": "Выгрузи данные о всех клиентах private banking, проанализируй wealth composition и investment preferences по сегментам HNWI, вычисли optimal asset allocation с учётом tax efficiency, структурируй personalized wealth planning strategies включая estate planning, подготовь comprehensive wealth reports для клиентов, составь требования к wealth management platform, адаптируй advisory materials для различных client profiles и рассчитай projected wealth growth и tax optimization.", "notes": "SQL для клиентов, Data Analysis для preferences, Math для allocation, Structured Extraction для strategies, Summarization для reports, Requirements для platform, Rewrite для materials, Finance для projections."}
{"id": "ex_0164", "required_agents": [3, 7], "difficulty": 1, "eval_hint": "мат + стиль", "text": "Вычисли производную сложной функции и объясни результат простым языком для студентов.", "notes": "Math для производной + Rewrite для студентов."}
{"id": "ex_0125", "required_agents": [1, 2, 3, 5, 6, 7, 8], "difficulty": 6, "eval_hint": "SQL + анализ + мат + резюме + ТЗ + стиль + финансы", "text": "Выгрузи полную историю сделок на финансовых рынках, проанализируй паттерны торговой активности, вычисли показатели эффективности стратегий с учётом риска, подготовь комплексный отчёт для инвестиционного комитета, составь требования к системе risk-management, адаптируй рекомендации для портфельных менеджеров и рассчитай максимальную просадку и Sharpe ratio по каждой стратегии.", "notes": "SQL для истории, Data Analysis для паттернов, Math для показателей, Summarization для отчёта, Requirements для risk-management, Rewrite для менеджеров, Finance для Sharpe."}
{"id": "ex_0280", "required_agents": [1, 3, 4, 5, 6, 7], "difficulty": 5, "eval_hint": "SQL + мат + JSON + резюме + ТЗ + стиль", "text": "Извлеки данные о логистических маршрутах, вычисли оптимальные пути доставки, структурируй график маршрутов, подготовь краткие отчёты для диспетчеров, составь требования к навигационной системе и адаптируй инструкции для водителей.", "notes": "SQL для данных, Math для оптимизации, Structured Extraction для графика, Summarization для отчётов, Requirements для навигации, Rewrite для инструкций."}
{"id": "ex_0192", "required_agents": [3, 4, 5], "difficulty": 2, "eval_hint": "мат + JSON + резюме", "text": "Реши задачу оптимизации, структурируй результаты расчётов и подготовь краткое резюме рекомендаций.", "notes": "Math для оптимизации, Structured Extraction для результатов, Summarization для резюме."}
{"id": "ex_0294", "required_agents": [0, 2, 4, 6, 7, 8], "difficulty": 5, "eval_hint": "код + анализ + JSON + ТЗ + стиль + финансы", "text": "Разработай платформу для управления партнёрской программой: реализуй трекинг реферальных продаж, обработай данные о комиссионных, структурируй выплаты партнёрам, составь требования к процессу начисления, адаптируй личный кабинет под партнёров и рассчитай общий фонд вознаграждений.", "notes": "Code для платформы, Data Analysis для продаж, Structured Extraction для выплат, Requirements для начисления, Rewrite для кабинета, Finance для фонда."}
{"id": "ex_0170", "required_agents": [0, 1], "difficulty": 1, "eval_hint": "код + SQL", "text": "Создай скрипт для резервного копирования таблиц базы данных в файлы.", "notes": "Code для скрипта + SQL для копирования."}
{"id": "ex_0071", "required_agents": [1, 2, 4, 6, 8], "difficulty": 4, "eval_hint": "SQL + анализ + JSON + ТЗ + финансы", "text": "Выгрузи транзакции по счетам, проанализируй аномальные операции, структурируй подозрительные паттерны, составь требования к системе мониторинга и оцени потенциальные финансовые риски.", "notes": "SQL для транзакций, Data Analysis для аномалий, Structured Extraction для паттернов, Requirements для системы, Finance для рисков."}
{"id": "ex_0084", "required_agents": [0, 1, 3, 4, 6, 8], "difficulty": 5, "eval_hint": "код + SQL + мат + JSON + ТЗ + финансы", "text": "Разработай модуль для расчёта пенсионных накоплений: интегрируй с базой данных сотрудников, реализуй актуарные вычисления, структурируй персональные планы в стандартном формате, составь спецификацию отчётности для ПФР и добавь расчёт инвестиционного дохода.", "notes": "Code для модуля, SQL для интеграции, Math для актуарных расчётов, Structured Extraction для планов, Requirements для отчётности, Finance для дохода."}
{"id": "ex_0256", "required_agents": [0, 1, 4, 6, 7], "difficulty": 4, "eval_hint": "код + SQL + JSON + ТЗ + стиль", "text": "Разработай API для интеграции с партнёрскими системами: реализуй обработку запросов, загружай справочники из базы, структурируй формат обмена, составь техническую документацию и адаптируй её для внешних разработчиков.", "notes": "Code для API, SQL для справочников, Structured Extraction для формата, Requirements для документации, Rewrite для разработчиков."}
{"id": "ex_0283", "required_agents": [1, 2, 4, 5, 6, 8], "difficulty": 5, "eval_hint": "SQL + анализ + JSON + резюме + ТЗ + финансы", "text": "Выгрузи данные о структуре затрат на персонал, проанализируй распределение по департаментам, извлеки детализацию в структурированный вид, подготовь краткий отчёт для CFO, составь требования к оптимизации ФОТ и рассчитай потенциальную экономию.", "notes": "SQL для выгрузки, Data Analysis для распределения, Structured Extraction для детализации, Summarization для отчёта, Requirements для оптимизации, Finance для экономии."}
{"id": "ex_0224", "required_agents": [0, 4, 6, 7], "difficulty": 3, "eval_hint": "код + JSON + ТЗ + стиль", "text": "Создай парсер для обработки резюме соискателей, извлекай ключевые навыки в структурированный вид, составь требования к системе подбора и адаптируй шаблоны для HR.", "notes": "Code для парсера, Structured Extraction для навыков, Requirements для подбора, Rewrite для HR."}
{"id": "ex_0078", "required_agents": [0, 2, 4, 5, 8], "difficulty": 4, "eval_hint": "код + анализ + JSON + резюме + финансы", "text": "Создай инструмент для анализа инвестиционного портфеля: обработай данные о позициях, извлеки информацию по классам активов, сформируй краткий обзор и рассчитай диверсификацию и корреляции.", "notes": "Code для инструмента, Data Analysis для обработки, Structured Extraction для классов, Summarization для обзора, Finance для диверсификации."}
{"id": "ex_0248", "required_agents": [0, 1, 2, 5, 6], "difficulty": 4, "eval_hint": "код + SQL + анализ + резюме + ТЗ", "text": "Создай платформу для мониторинга SLA: загружай метрики из базы, реализуй анализ нарушений, формируй ежедневные отчёты для менеджмента и составь требования к системе алертинга.", "notes": "Code для платформы, SQL для метрик, Data Analysis для нарушений, Summarization для отчётов, Requirements для алертинга."}
{"id": "ex_0267", "required_agents": [0, 1, 2, 5, 6, 8], "difficulty": 5, "eval_hint": "код + SQL + анализ + резюме + ТЗ + финансы", "text": "Создай платформу для финансового планирования: загружай бюджетные данные из систем учёта, реализуй сценарное моделирование, проанализируй исполнение планов, генерируй ежемесячные отчёты для CFO, составь требования к процессу бюджетирования и рассчитай variance по статьям.", "notes": "Code для платформы, SQL для загрузки, Data Analysis для планов, Summarization для отчётов, Requirements для бюджетирования, Finance для variance."}
{"id": "ex_0013", "required_agents": [1, 2, 5], "difficulty": 2, "eval_hint": "SQL + анализ + резюме", "text": "Выполни запрос по продажам филиалов, сравни показатели между регионами и составь краткий вывод с рекомендациями.", "notes": "SQL для запроса, Data Analysis для сравнения, Summarization для вывода."}
{"id": "ex_0076", "required_agents": [0, 1, 5, 7, 8], "difficulty": 4, "eval_hint": "код + SQL + резюме + стиль + финансы", "text": "Разработай автоматизированный отчёт о прибылях и убытках: выгружай данные из учётной системы, генерируй краткие саммари по подразделениям, адаптируй формат для разных стейкхолдеров и рассчитай EBITDA.", "notes": "Code для отчёта, SQL для выгрузки, Summarization для саммари, Rewrite для стейкхолдеров, Finance для EBITDA."}
{"id": "ex_0019", "required_agents": [5, 6, 7], "difficulty": 2, "eval_hint": "резюме + ТЗ + стиль", "text": "Подготовь краткий обзор текущего функционала системы, на его основе составь требования к новой версии и адаптируй под презентацию стейкхолдерам.", "notes": "Summarization для обзора, Requirements для требований, Rewrite для презентации."}
{"id": "ex_0182", "required_agents": [1, 2, 6], "difficulty": 2, "eval_hint": "SQL + анализ + ТЗ", "text": "Выгрузи данные о производительности сотрудников, проанализируй показатели по отделам и составь требования к системе KPI.", "notes": "SQL для выгрузки, Data Analysis для анализа, Requirements для KPI."}
{"id": "ex_0171", "required_agents": [2, 7], "difficulty": 1, "eval_hint": "анализ + стиль", "text": "Проанализируй отзывы клиентов, выдели основные темы и переформулируй выводы для публикации на сайте.", "notes": "Data Analysis для анализа + Rewrite для публикации."}
{"id": "ex_0229", "required_agents": [0, 1, 3, 6], "difficulty": 3, "eval_hint": "код + SQL + мат + ТЗ", "text": "Создай инструмент для численного решения уравнений: интегрируй с базой параметров, реализуй алгоритмы и составь техническую документацию.", "notes": "Code для инструмента, SQL для параметров, Math для алгоритмов, Requirements для документации."}
{"id": "ex_0032", "required_agents": [1, 2, 3, 5], "difficulty": 3, "eval_hint": "SQL + анализ + мат + резюме", "text": "Выгрузи метрики производительности системы, построй регрессионную модель для прогноза нагрузки, проанализируй аномалии и подготовь развёрнутый отчёт.", "notes": "SQL для метрик, Data Analysis для аномалий, Math для регрессии, Summarization для отчёта."}
{"id": "ex_0143", "required_agents": [0, 1, 2, 3, 4, 5, 6, 7, 8], "difficulty": 8, "eval_hint": "код + SQL + анализ + мат + JSON + резюме + ТЗ + стиль + финансы", "text": "Разработай платформу для автоматизации процессов андеррайтинга и risk management в страховой компании: создай модули для сбора и валидации данных о рисках из различных источников, интегрируй с внешними базами данных и системами оценки, реализуй актуарные модели pricing с учётом индивидуальных характеристик риска, вычисли технические резервы по всем линиям бизнеса с применением современных стохастических методов, проанализируй структуру портфеля и концентрации рисков, примени модели катастрофического моделирования для оценки экстремальных сценариев, структурируй программу перестрахования с оптимизацией retention levels, генерируй автоматические отчёты о подписанных рисках и убыточности для андеррайтеров, составь требования к интеграции с системами урегулирования убытков, адаптируй методологию под требования Solvency II и локального регулятора и рассчитай экономический капитал и solvency ratio с учётом всех рисков.", "notes": "Code для платформы, SQL для интеграции, Data Analysis для концентраций, Math для актуарных моделей, Structured Extraction для перестрахования, Summarization для отчётов, Requirements для урегулирования, Rewrite для регулятора, Finance для solvency."}
{"id": "ex_0302", "required_agents": [0, 1, 2, 3, 4, 6, 7, 8], "difficulty": 7, "eval_hint": "код + SQL + анализ + мат + JSON + ТЗ + стиль + финансы", "text": "Разработай систему для комплексного управления рисками портфеля: создай модули для расчёта рыночного, кредитного и операционного риска, загружай позиции из торговых систем, реализуй стохастические модели и симуляции Монте-Карло, вычисли VaR и CVaR, проанализируй концентрации и корреляции, структурируй лимиты и их утилизацию, составь требования к risk governance, адаптируй отчётность для регулятора и рассчитай экономический капитал.", "notes": "Code для системы, SQL для позиций, Data Analysis для концентраций, Math для Монте-Карло, Structured Extraction для лимитов, Requirements для governance, Rewrite для регулятора, Finance для капитала."}
{"id": "ex_0250", "required_agents": [0, 3, 4, 6, 8], "difficulty": 4, "eval_hint": "код + мат + JSON + ТЗ + финансы", "text": "Реализуй модель для расчёта ставок по кредитам: примени скоринговые методы, структурируй параметры заёмщиков, составь требования к процессу одобрения и вычисли риск-премию.", "notes": "Code для модели, Math для методов, Structured Extraction для параметров, Requirements для одобрения, Finance для премии."}
{"id": "ex_0206", "required_agents": [3, 5, 6], "difficulty": 2, "eval_hint": "мат + резюме + ТЗ", "text": "Вычисли оптимальные параметры производственного процесса, подготовь краткое резюме и составь рекомендации по настройке оборудования.", "notes": "Math для оптимизации, Summarization для резюме, Requirements для настройки."}
{"id": "ex_0217", "required_agents": [1, 2, 3, 7], "difficulty": 3, "eval_hint": "SQL + анализ + мат + стиль", "text": "Выгрузи данные о посещаемости веб-ресурса, проанализируй поведение пользователей, вычисли метрики вовлечённости и переформулируй выводы для маркетологов.", "notes": "SQL для выгрузки, Data Analysis для поведения, Math для метрик, Rewrite для маркетологов."}
{"id": "ex_0310", "required_agents": [0, 1, 2, 4, 5, 6, 7, 8], "difficulty": 7, "eval_hint": "код + SQL + анализ + JSON + резюме + ТЗ + стиль + финансы", "text": "Разработай систему для комплексного управления продуктовым портфелем банка: создай модули для анализа рентабельности каждого продукта, загружай данные о клиентах и транзакциях, реализуй расчёт product profitability с allocation накладных расходов, проанализируй cross-sell и penetration, структурируй продуктовые стратегии по сегментам, генерируй отчёты для product owners, составь требования к процессу product development, адаптируй business cases под investment committee и рассчитай contribution каждого продукта в общую прибыль.", "notes": "Code для системы, SQL для данных, Data Analysis для cross-sell, Structured Extraction для стратегий, Summarization для отчётов, Requirements для development, Rewrite для business cases, Finance для contribution."}
{"id": "ex_0141", "required_agents": [0, 1, 2, 3, 4, 5, 6, 7, 8], "difficulty": 8, "eval_hint": "код + SQL + анализ + мат + JSON + резюме + ТЗ + стиль + финансы", "text": "Разработай enterprise-систему для комплексного управления финансами холдинга: создай модули консолидации отчётности всех дочерних компаний с различными системами учёта, интегрируй с ERP и казначейскими системами для сбора данных о транзакциях, реализуй автоматическую элиминацию внутригрупповых оборотов и расчёт валютных разниц, проанализируй структуру активов и обязательств по всем юридическим лицам, вычисли финансовые коэффициенты и compliance с ковенантами, примени модели прогнозирования денежных потоков и сценарного планирования, структурируй консолидированную отчётность по МСФО и РСБУ, генерируй автоматические управленческие отчёты для различных уровней менеджмента, составь требования к процессу закрытия периода и подготовки внешней отчётности, адаптируй презентацию финансовых результатов для совета директоров и инвесторов и рассчитай стоимость капитала группы, EVA по бизнес-единицам и влияние корпоративных решений на консолидированные показатели.", "notes": "Code для системы, SQL для интеграции, Data Analysis для структуры, Math для моделей, Structured Extraction для отчётности, Summarization для управленческих отчётов, Requirements для процесса, Rewrite для инвесторов, Finance для всех финансовых расчётов."}
{"id": "ex_0100", "required_agents": [0, 2, 3, 4, 6, 7], "difficulty": 5, "eval_hint": "код + анализ + мат + JSON + ТЗ + стиль", "text": "Разработай платформу для A/B-тестирования: реализуй механизм случайного распределения пользователей, обработай метрики вовлечённости, вычисли статистическую значимость результатов, структурируй выводы по экспериментам, составь гайдлайны по проведению тестов и адаптируй их для продуктовых менеджеров.", "notes": "Code для платформы, Data Analysis для метрик, Math для значимости, Structured Extraction для выводов, Requirements для гайдлайнов, Rewrite для менеджеров."}
{"id": "ex_0065", "required_agents": [1, 2, 5, 6, 7], "difficulty": 4, "eval_hint": "SQL + анализ + резюме + ТЗ + стиль", "text": "Выгрузи метрики качества обслуживания, проанализируй динамику по периодам, подготовь краткий отчёт для руководства, составь план улучшения и адаптируй его для презентации команде поддержки.", "notes": "SQL для метрик, Data Analysis для динамики, Summarization для отчёта, Requirements для плана, Rewrite для команды."}
{"id": "ex_0299", "required_agents": [2, 4, 5, 6, 7, 8], "difficulty": 5, "eval_hint": "анализ + JSON + резюме + ТЗ + стиль + финансы", "text": "Проанализируй структуру доходов и расходов по проектам, извлеки ключевые показатели в структурированный вид, подготовь краткий управленческий отчёт, составь требования к проектному учёту, адаптируй презентацию для совета директоров и рассчитай прибыльность каждого проекта.", "notes": "Data Analysis для проектов, Structured Extraction для показателей, Summarization для отчёта, Requirements для учёта, Rewrite для совета, Finance для прибыльности."}
{"id": "ex_0175", "required_agents": [0, 2], "difficulty": 1, "eval_hint": "код + анализ", "text": "Напиши скрипт для чтения CSV-файла и вычисли базовую статистику по числовым колонкам.", "notes": "Code для скрипта + Data Analysis для статистики."}
{"id": "ex_0163", "required_agents": [2, 6], "difficulty": 1, "eval_hint": "анализ + ТЗ", "text": "Проанализируй распределение нагрузки на серверы и составь требования к балансировщику.", "notes": "Data Analysis для нагрузки + Requirements для балансировщика."}
{"id": "set_0001", "required_agents": [0, 1, 2], "difficulty": 2, "eval_hint": "multi_check", "text": "Нужно проанализировать данные о продажах за последний квартал. Сначала напиши SQL-запрос для извлечения данных из таблицы sales (поля: product_id, amount, date), затем загрузи результат в pandas и посчитай топ-5 товаров по выручке. Финально выведи результат в виде Python-функции get_top_products().", "notes": "комбо: SQL + Pandas + Code"}
{"id": "ex_0056", "required_agents": [0, 1, 6, 8], "difficulty": 3, "eval_hint": "код + SQL + ТЗ + финансы", "text": "Разработай модуль для автоматического расчёта зарплат, интегрируй его с базой кадровых данных, составь требования к учёту налогов и добавь расчёт премиальных.", "notes": "Code для модуля, SQL для интеграции, Requirements для налогов, Finance для премиальных."}
{"id": "ex_0151", "required_agents": [3, 5], "difficulty": 1, "eval_hint": "мат + резюме", "text": "Реши задачу на вычисление площади фигуры методом интегрирования и кратко опиши результат.", "notes": "Math для интеграла + Summarization для описания."}
{"id": "ex_0066", "required_agents": [0, 3, 4, 5, 6], "difficulty": 4, "eval_hint": "код + мат + JSON + резюме + ТЗ", "text": "Реализуй калькулятор для расчёта сложных инженерных конструкций, примени методы конечных элементов, структурируй результаты расчёта, создай краткое описание и составь техническое задание на интеграцию.", "notes": "Code для калькулятора, Math для методов, Structured Extraction для результатов, Summarization для описания, Requirements для ТЗ."}
{"id": "ex_0120", "required_agents": [0, 1, 3, 4, 5, 6, 8], "difficulty": 6, "eval_hint": "код + SQL + мат + JSON + резюме + ТЗ + финансы", "text": "Разработай комплексное решение для pricing финансовых продуктов: создай модули расчёта справедливой стоимости для различных инструментов, интегрируй с рыночными источниками данных, реализуй математические модели оценки опционов и структурных продуктов, извлекай параметры сделок в стандартном формате, генерируй краткие отчёты о переоценке портфеля, составь спецификацию методологии оценки для внутреннего контроля и рассчитай P&L с учётом изменения рыночных факторов.", "notes": "Code для решения, SQL для интеграции, Math для моделей, Structured Extraction для параметров, Summarization для отчётов, Requirements для методологии, Finance для P&L."}
{"id": "ex_0284", "required_agents": [0, 1, 3, 4, 7, 8], "difficulty": 5, "eval_hint": "код + SQL + мат + JSON + стиль + финансы", "text": "Разработай систему для pricing облачных сервисов: интегрируй с биллингом, реализуй расчёт стоимости по моделям потребления, вычисли тарификацию, структурируй прайс-листы, адаптируй их для разных сегментов клиентов и рассчитай маржинальность.", "notes": "Code для системы, SQL для биллинга, Math для расчёта, Structured Extraction для прайсов, Rewrite для сегментов, Finance для маржинальности."}
{"id": "ex_0077", "required_agents": [2, 3, 4, 6, 7], "difficulty": 4, "eval_hint": "анализ + мат + JSON + ТЗ + стиль", "text": "Проанализируй результаты клинических испытаний, вычисли статистические показатели эффективности препарата, структурируй данные по группам, составь протокол дальнейших исследований и адаптируй выводы для научной публикации.", "notes": "Data Analysis для результатов, Math для показателей, Structured Extraction для структуры, Requirements для протокола, Rewrite для публикации."}
{"id": "ex_0208", "required_agents": [1, 3, 5], "difficulty": 2, "eval_hint": "SQL + мат + резюме", "text": "Выгрузи данные о производительности оборудования, вычисли коэффициент использования и подготовь краткий отчёт.", "notes": "SQL для выгрузки, Math для коэффициента, Summarization для отчёта."}
{"id": "ex_0196", "required_agents": [5, 6, 8], "difficulty": 2, "eval_hint": "резюме + ТЗ + финансы", "text": "Подготовь краткое резюме бизнес-плана, составь требования к финансовой модели и рассчитай точку безубыточности.", "notes": "Summarization для резюме, Requirements для модели, Finance для безубыточности."}
{"id": "ex_0298", "required_agents": [0, 1, 2, 3, 6, 7], "difficulty": 5, "eval_hint": "код + SQL + анализ + мат + ТЗ + стиль", "text": "Создай платформу для оптимизации рекламных кампаний: загружай данные о показах и кликах, реализуй алгоритмы машинного обучения для прогнозирования конверсий, обработай метрики эффективности, вычисли оптимальные ставки, составь требования к автоматизации и адаптируй дашборд для маркетологов.", "notes": "Code для платформы, SQL для данных, Data Analysis для метрик, Math для ML, Requirements для автоматизации, Rewrite для дашборда."}
{"id": "ex_0186", "required_agents": [1, 3, 7], "difficulty": 2, "eval_hint": "SQL + мат + стиль", "text": "Получи данные о посещаемости сайта, вычисли тренды роста и переформулируй выводы для презентации инвесторам.", "notes": "SQL для данных, Math для трендов, Rewrite для инвесторов."}
{"id": "ex_0262", "required_agents": [0, 2, 3, 4, 6, 8], "difficulty": 5, "eval_hint": "код + анализ + мат + JSON + ТЗ + финансы", "text": "Создай систему для оценки эффективности инвестиционного портфеля: реализуй расчёт доходности и рисков, обработай исторические данные, вычисли оптимальное распределение активов, структурируй рекомендации по ребалансировке, составь требования к процессу мониторинга и рассчитай транзакционные издержки.", "notes": "Code для системы, Data Analysis для данных, Math для оптимизации, Structured Extraction для рекомендаций, Requirements для мониторинга, Finance для издержек."}
{"id": "ex_0241", "required_agents": [0, 1, 2, 3, 4], "difficulty": 4, "eval_hint": "код + SQL + анализ + мат + JSON", "text": "Создай платформу для анализа экспериментов: загружай результаты тестов из базы, реализуй статистические проверки гипотез, обработай данные по группам, структурируй выводы и вычисли доверительные интервалы.", "notes": "Code для платформы, SQL для загрузки, Data Analysis для групп, Math для проверок, Structured Extraction для выводов."}
{"id": "ex_0277", "required_agents": [0, 1, 2, 3, 5, 7], "difficulty": 5, "eval_hint": "код + SQL + анализ + мат + резюме + стиль", "text": "Создай систему для анализа качества кода: загружай метрики из репозиториев, реализуй расчёт технических показателей, обработай данные по командам, вычисли индексы сложности, сформируй краткие отчёты для тимлидов и адаптируй презентацию для технического директора.", "notes": "Code для системы, SQL для репозиториев, Data Analysis для команд, Math для индексов, Summarization для отчётов, Rewrite для директора."}
{"id": "ex_0062", "required_agents": [2, 4, 6, 8], "difficulty": 3, "eval_hint": "анализ + JSON + ТЗ + финансы", "text": "Изучи паттерны расходов пользователей, извлеки типовые сценарии в структурированный вид, составь требования к системе рекомендаций и оцени потенциальную выгоду.", "notes": "Data Analysis для паттернов, Structured Extraction для сценариев, Requirements для рекомендаций, Finance для выгоды."}
{"id": "ex_0097", "required_agents": [1, 3, 4, 5, 6, 8], "difficulty": 5, "eval_hint": "SQL + мат + JSON + резюме + ТЗ + финансы", "text": "Извлеки данные о лизинговых платежах, вычисли эффективную процентную ставку по каждому договору, структурируй график платежей, подготовь краткий отчёт о портфеле, составь рекомендации по рефинансированию и рассчитай потенциальную выгоду.", "notes": "SQL для данных, Math для ставки, Structured Extraction для графика, Summarization для отчёта, Requirements для рефинансирования, Finance для выгоды."}
{"id": "ex_0152", "required_agents": [4, 6], "difficulty": 1, "eval_hint": "JSON + ТЗ", "text": "Извлеки из текстового описания API параметры запросов в структурированный формат и составь краткие требования к валидации.", "notes": "Structured Extraction для параметров + Requirements для валидации."}
{"id": "ex_0047", "required_agents": [3, 5, 6, 7], "difficulty": 3, "eval_hint": "мат + резюме + ТЗ + стиль", "text": "Реши задачу нелинейной оптимизации для планирования производства, подготовь краткое описание решения, составь рекомендации по внедрению и адаптируй их для производственного отдела.", "notes": "Math для оптимизации, Summarization для описания, Requirements для рекомендаций, Rewrite для отдела."}
{"id": "ex_0254", "required_agents": [0, 2, 3, 4, 7], "difficulty": 4, "eval_hint": "код + анализ + мат + JSON + стиль", "text": "Создай инструмент для обработки геоданных: реализуй алгоритмы кластеризации точек, обработай координаты объектов, вычисли оптимальные центры, структурируй результаты и адаптируй визуализацию для разных пользователей.", "notes": "Code для инструмента, Data Analysis для объектов, Math для кластеризации, Structured Extraction для результатов, Rewrite для визуализации."}
{"id": "ex_0028", "required_agents": [4, 7, 8], "difficulty": 2, "eval_hint": "JSON + стиль + финансы", "text": "Извлеки из договора финансовые условия в структурированный вид, переформулируй их понятным языком и рассчитай полную стоимость владения.", "notes": "Structured Extraction для условий, Rewrite для понятности, Finance для расчёта."}
{"id": "ex_0117", "required_agents": [0, 1, 2, 5, 6, 7, 8], "difficulty": 6, "eval_hint": "код + SQL + анализ + резюме + ТЗ + стиль + финансы", "text": "Разработай систему для консолидации финансовой отчётности группы компаний: создай модули загрузки данных из различных учётных систем дочерних обществ, реализуй элиминацию внутригрупповых оборотов, проанализируй отклонения от бюджета по каждой компании, сформируй краткие управленческие отчёты для холдинга, составь требования к автоматизации процесса закрытия периода, адаптируй отчётность под требования МСФО и рассчитай консолидированную прибыль с учётом миноритарных долей.", "notes": "Code для системы, SQL для загрузки, Data Analysis для отклонений, Summarization для отчётов, Requirements для автоматизации, Rewrite для МСФО, Finance для прибыли."}
{"id": "ex_0009", "required_agents": [0, 1, 2], "difficulty": 2, "eval_hint": "код + SQL + анализ", "text": "Создай ETL-процесс: извлеки данные из базы, обработай их и построй сводную таблицу с метриками.", "notes": "Code для ETL, SQL для извлечения, Data Analysis для сводки."}
{"id": "ex_0237", "required_agents": [1, 3, 5, 7], "difficulty": 3, "eval_hint": "SQL + мат + резюме + стиль", "text": "Извлеки данные о производственных циклах, вычисли среднее время выполнения, подготовь краткий отчёт и адаптируй его для производственного отдела.", "notes": "SQL для данных, Math для времени, Summarization для отчёта, Rewrite для отдела."}
{"id": "ex_0072", "required_agents": [0, 1, 3, 5, 8], "difficulty": 4, "eval_hint": "код + SQL + мат + резюме + финансы", "text": "Создай систему для бэктестинга торговых стратегий: загружай котировки из базы, реализуй расчёт индикаторов, формируй краткие отчёты по каждой стратегии и вычисли максимальную просадку.", "notes": "Code для системы, SQL для котировок, Math для индикаторов, Summarization для отчётов, Finance для просадки."}
{"id": "ex_0004", "required_agents": [1, 2], "difficulty": 1, "eval_hint": "SQL + pandas", "text": "Выгрузи данные о заказах за последний месяц из базы и построй группировку по категориям товаров.", "notes": "SQL для выгрузки + Data Analysis для группировки."}
{"id": "ex_0006", "required_agents": [0, 2, 5], "difficulty": 2, "eval_hint": "код + анализ + резюме", "text": "Напиши скрипт для обработки CSV с метриками, посчитай средние значения по каждому показателю и сформируй краткий отчёт.", "notes": "Code для скрипта, Data Analysis для расчётов, Summarization для отчёта."}
{"id": "ex_0273", "required_agents": [1, 2, 3, 4, 6, 7], "difficulty": 5, "eval_hint": "SQL + анализ + мат + JSON + ТЗ + стиль", "text": "Выгрузи данные о пользовательских сессиях на платформе, проанализируй путь пользователей и точки выхода, вычисли метрики вовлечённости, структурируй рекомендации по улучшению UX, составь требования к редизайну и адаптируй презентацию для дизайн-команды.", "notes": "SQL для сессий, Data Analysis для пути, Math для метрик, Structured Extraction для рекомендаций, Requirements для редизайна, Rewrite для дизайнеров."}
{"id": "ex_0200", "required_agents": [2, 6, 7], "difficulty": 2, "eval_hint": "анализ + ТЗ + стиль", "text": "Проанализируй использование функций продукта, составь требования к доработкам и адаптируй roadmap для команды разработки.", "notes": "Data Analysis для использования, Requirements для доработок, Rewrite для roadmap."}
{"id": "ex_0159", "required_agents": [5, 8], "difficulty": 1, "eval_hint": "резюме + финансы", "text": "Подготовь краткое резюме квартального отчёта компании и выдели ключевые финансовые показатели.", "notes": "Summarization для резюме + Finance для показателей."}
{"id": "ex_0225", "required_agents": [1, 2, 4, 5], "difficulty": 3, "eval_hint": "SQL + анализ + JSON + резюме", "text": "Выгрузи данные о транзакциях платёжной системы, проанализируй паттерны использования, структурируй метрики по типам операций и подготовь краткий отчёт для регулятора.", "notes": "SQL для транзакций, Data Analysis для паттернов, Structured Extraction для метрик, Summarization для отчёта."}
{"id": "ex_0239", "required_agents": [0, 2, 6, 8], "difficulty": 3, "eval_hint": "код + анализ + ТЗ + финансы", "text": "Напиши модуль для расчёта себестоимости продукции, обработай данные о затратах, составь требования к системе учёта и рассчитай плановую маржу.", "notes": "Code для модуля, Data Analysis для затрат, Requirements для учёта, Finance для маржи."}
{"id": "ex_0094", "required_agents": [1, 2, 5, 6, 7, 8], "difficulty": 5, "eval_hint": "SQL + анализ + резюме + ТЗ + стиль + финансы", "text": "Выгрузи данные о выполнении бюджета по подразделениям, проанализируй отклонения от плана, подготовь краткий финансовый обзор для руководства, составь рекомендации по корректировке бюджета, адаптируй их для менеджеров департаментов и рассчитай прогнозируемую экономию.", "notes": "SQL для выгрузки, Data Analysis для отклонений, Summarization для обзора, Requirements для рекомендаций, Rewrite для менеджеров, Finance для экономии."}
{"id": "ex_0269", "required_agents": [1, 3, 4, 5, 7, 8], "difficulty": 5, "eval_hint": "SQL + мат + JSON + резюме + стиль + финансы", "text": "Выгрузи данные о страховых премиях и убытках, вычисли loss ratio по продуктам, структурируй актуарный анализ, подготовь краткий обзор для андеррайтинга, адаптируй его для презентации правлению и рассчитай необходимые резервы.", "notes": "SQL для выгрузки, Math для loss ratio, Structured Extraction для анализа, Summarization для обзора, Rewrite для правления, Finance для резервов."}
{"id": "ex_0022", "required_agents": [2, 6, 8], "difficulty": 2, "eval_hint": "анализ + ТЗ + финансы", "text": "Проанализируй юнит-экономику продукта, составь требования к оптимизации воронки и рассчитай влияние на LTV.", "notes": "Data Analysis для анализа, Requirements для оптимизации, Finance для LTV."}
{"id": "ex_0008", "required_agents": [3, 4, 8], "difficulty": 2, "eval_hint": "мат + JSON + финансы", "text": "Реши задачу оптимизации портфеля из трёх активов, оформи результат в структурированном виде и рассчитай ожидаемую доходность.", "notes": "Math для оптимизации, Structured Extraction для структуры, Finance для доходности."}
{"id": "ex_0121", "required_agents": [0, 2, 3, 5, 6, 7, 8], "difficulty": 6, "eval_hint": "код + анализ + мат + резюме + ТЗ + стиль + финансы", "text": "Создай систему для анализа эффективности маркетинговых кампаний: реализуй сбор данных из рекламных платформ и CRM, обработай метрики вовлечённости и конверсии, вычисли атрибуционные модели с использованием машинного обучения, сформируй краткие инсайты для маркетинговой команды, составь требования к автоматизации отчётности, адаптируй презентацию результатов для топ-менеджмента и рассчитай ROI каждой кампании с учётом полного цикла покупки.", "notes": "Code для системы, Data Analysis для метрик, Math для атрибуции, Summarization для инсайтов, Requirements для автоматизации, Rewrite для топ-менеджмента, Finance для ROI."}
{"id": "ex_0263", "required_agents": [0, 1, 4, 5, 7, 8], "difficulty": 5, "eval_hint": "код + SQL + JSON + резюме + стиль + финансы", "text": "Разработай платформу для управления подписками клиентов: интегрируй с биллинговой системой, извлекай данные о платежах в структурированный вид, генерируй персонализированные отчёты, адаптируй коммуникацию под разные тарифы и рассчитай churn rate.", "notes": "Code для платформы, SQL для интеграции, Structured Extraction для данных, Summarization для отчётов, Rewrite для коммуникации, Finance для churn."}
{"id": "ex_0202", "required_agents": [4, 5, 6], "difficulty": 2, "eval_hint": "JSON + резюме + ТЗ", "text": "Извлеки структуру организации из схемы, подготовь краткое описание подразделений и составь требования к системе управления персоналом.", "notes": "Structured Extraction для структуры, Summarization для описания, Requirements для системы."}
{"id": "ex_0165", "required_agents": [0, 8], "difficulty": 1, "eval_hint": "код + финансы", "text": "Реализуй калькулятор простых процентов с возможностью задания срока и ставки.", "notes": "Code для калькулятора + Finance для процентов."}
{"id": "ex_0185", "required_agents": [0, 4, 6], "difficulty": 2, "eval_hint": "код + JSON + ТЗ", "text": "Создай парсер конфигурационных файлов, извлекай параметры в структурированный формат и составь документацию по использованию.", "notes": "Code для парсера, Structured Extraction для параметров, Requirements для документации."}
{"id": "ex_0244", "required_agents": [0, 1, 3, 7, 8], "difficulty": 4, "eval_hint": "код + SQL + мат + стиль + финансы", "text": "Создай систему для автоматического расчёта финансовых коэффициентов: загружай данные отчётности из базы, реализуй формулы расчёта, адаптируй представление под аналитиков и вычисли показатели ликвидности.", "notes": "Code для системы, SQL для отчётности, Math для формул, Rewrite для аналитиков, Finance для ликвидности."}
{"id": "ex_0271", "required_agents": [2, 3, 4, 5, 6, 8], "difficulty": 5, "eval_hint": "анализ + мат + JSON + резюме + ТЗ + финансы", "text": "Проанализируй эффективность использования рекламного бюджета: обработай данные о кампаниях, вычисли ROI и CPA, структурируй рекомендации по каналам, подготовь краткий отчёт для CMO, составь требования к автоматизации закупки медиа и рассчитай оптимальное распределение бюджета.", "notes": "Data Analysis для кампаний, Math для ROI, Structured Extraction для рекомендаций, Summarization для отчёта, Requirements для автоматизации, Finance для распределения."}
{"id": "ex_0124", "required_agents": [0, 2, 3, 4, 5, 7, 8], "difficulty": 6, "eval_hint": "код + анализ + мат + JSON + резюме + стиль + финансы", "text": "Создай систему для оценки и мониторинга операционных рисков: реализуй сбор данных о инцидентах и потерях, обработай статистику по категориям рисков, вычисли распределения потерь методом Loss Distribution Approach, структурируй карту рисков, сформируй краткие отчёты для риск-менеджмента, адаптируй их для комитета по рискам и рассчитай капитал под операционный риск.", "notes": "Code для системы, Data Analysis для статистики, Math для LDA, Structured Extraction для карты, Summarization для отчётов, Rewrite для комитета, Finance для капитала."}
{"id": "ex_0136", "required_agents": [0, 2, 3, 4, 5, 6, 7, 8], "difficulty": 7, "eval_hint": "код + анализ + мат + JSON + резюме + ТЗ + стиль + финансы", "text": "Разработай платформу для predictive maintenance производственного оборудования: создай модули сбора телеметрии с датчиков, обработай временные ряды показателей работы машин, реализуй модели прогнозирования отказов с использованием ML и статистических методов, вычисли оптимальные интервалы обслуживания, структурируй рекомендации по техническому обслуживанию, сформируй автоматические alert'ы и отчёты для технического персонала, составь требования к интеграции с CMMS, адаптируй дашборды под разные уровни управления и рассчитай экономический эффект от снижения простоев.", "notes": "Code для платформы, Data Analysis для телеметрии, Math для ML, Structured Extraction для рекомендаций, Summarization для отчётов, Requirements для CMMS, Rewrite для дашбордов, Finance для эффекта."}
{"id": "ex_0249", "required_agents": [2, 3, 5, 7, 8], "difficulty": 4, "eval_hint": "анализ + мат + резюме + стиль + финансы", "text": "Обработай данные о продажах франшиз, вычисли средние показатели по регионам, подготовь краткий анализ, адаптируй его для презентации франчайзи и рассчитай роялти.", "notes": "Data Analysis для продаж, Math для показателей, Summarization для анализа, Rewrite для франчайзи, Finance для роялти."}
{"id": "ex_0286", "required_agents": [0, 2, 5, 6, 7, 8], "difficulty": 5, "eval_hint": "код + анализ + резюме + ТЗ + стиль + финансы", "text": "Создай дашборд для визуализации финансового состояния компании: обработай данные управленческого учёта, реализуй расчёт ключевых индикаторов, генерируй автоматические саммари, составь требования к доступу по ролям, адаптируй интерфейс под разные уровни менеджмента и рассчитай прогнозные показатели.", "notes": "Code для дашборда, Data Analysis для учёта, Summarization для саммари, Requirements для доступа, Rewrite для интерфейса, Finance для показателей."}
{"id": "ex_0243", "required_agents": [1, 3, 4, 5, 8], "difficulty": 4, "eval_hint": "SQL + мат + JSON + резюме + финансы", "text": "Выгрузи данные о структуре инвестиционного портфеля, вычисли риск-метрики и корреляции, структурируй активы по классам, подготовь краткий отчёт для клиента и рассчитай ожидаемую доходность.", "notes": "SQL для портфеля, Math для риск-метрик, Structured Extraction для классов, Summarization для отчёта, Finance для доходности."}
{"id": "ex_0044", "required_agents": [2, 3, 4, 5], "difficulty": 3, "eval_hint": "анализ + мат + JSON + резюме", "text": "Обработай результаты A/B-теста, вычисли статистическую значимость различий, структурируй данные по группам и подготовь краткий отчёт с рекомендациями.", "notes": "Data Analysis для обработки, Math для значимости, Structured Extraction для структуры, Summarization для отчёта."}
{"id": "ex_0037", "required_agents": [3, 4, 6, 8], "difficulty": 3, "eval_hint": "мат + JSON + ТЗ + финансы", "text": "Реши задачу оптимального распределения бюджета между проектами, оформи результаты в структурированном виде, составь рекомендации по инвестициям и рассчитай NPV каждого проекта.", "notes": "Math для оптимизации, Structured Extraction для результатов, Requirements для рекомендаций, Finance для NPV."}
{"id": "ex_0030", "required_agents": [0, 1, 5], "difficulty": 2, "eval_hint": "код + SQL + резюме", "text": "Реализуй сервис для мониторинга базы данных, выполни диагностические запросы и сформируй отчёт о состоянии системы.", "notes": "Code для сервиса, SQL для запросов, Summarization для отчёта."}
{"id": "ex_0265", "required_agents": [0, 3, 4, 5, 6, 7], "difficulty": 5, "eval_hint": "код + мат + JSON + резюме + ТЗ + стиль", "text": "Реализуй модель для прогнозирования спроса на товары: примени методы машинного обучения, вычисли точность предсказаний, структурируй прогнозы по категориям, сформируй краткие рекомендации для закупщиков, составь требования к интеграции с системой управления запасами и адаптируй отчёты под департаменты.", "notes": "Code для модели, Math для ML, Structured Extraction для прогнозов, Summarization для рекомендаций, Requirements для интеграции, Rewrite для департаментов."}
{"id": "ex_0311", "required_agents": [0, 2, 3, 4, 5, 6, 7, 8], "difficulty": 7, "eval_hint": "код + анализ + мат + JSON + резюме + ТЗ + стиль + финансы", "text": "Создай платформу для автоматизации venture capital инвестиций: реализуй модули для оценки стартапов на разных стадиях, обработай данные о рынках и конкурентах, вычисли потенциальную доходность с учётом различных exit scenarios, примени модели оценки pre-money/post-money valuation, структурируй term sheets и cap tables, генерируй investment memos для партнёров, составь требования к portfolio management, адаптируй LP reporting и рассчитай IRR и TVPI фонда.", "notes": "Code для платформы, Data Analysis для рынков, Math для моделей оценки, Structured Extraction для term sheets, Summarization для memos, Requirements для portfolio management, Rewrite для LP reporting, Finance для IRR/TVPI."}
{"id": "ex_0176", "required_agents": [1, 7], "difficulty": 1, "eval_hint": "SQL + стиль", "text": "Выгрузи описания продуктов из каталога и переформулируй их для e-commerce сайта.", "notes": "SQL для выгрузки + Rewrite для сайта."}
{"id": "ex_0253", "required_agents": [2, 4, 6, 7, 8], "difficulty": 4, "eval_hint": "анализ + JSON + ТЗ + стиль + финансы", "text": "Проанализируй структуру издержек по проектам, извлеки ключевые драйверы затрат в структурированный вид, составь требования к системе контроля бюджета, адаптируй отчёты для проектных менеджеров и рассчитай variance analysis.", "notes": "Data Analysis для издержек, Structured Extraction для драйверов, Requirements для контроля, Rewrite для менеджеров, Finance для variance."}
{"id": "ex_0177", "required_agents": [3, 8], "difficulty": 1, "eval_hint": "мат + финансы", "text": "Рассчитай будущую стоимость инвестиции при ежегодной капитализации процентов.", "notes": "Math для формул + Finance для инвестиции."}
{"id": "ex_0231", "required_agents": [0, 3, 4, 8], "difficulty": 3, "eval_hint": "код + мат + JSON + финансы", "text": "Реализуй калькулятор для оценки опционов методом биномиального дерева, структурируй параметры расчёта и вычисли справедливую цену.", "notes": "Code для калькулятора, Math для метода, Structured Extraction для параметров, Finance для цены."}
{"id": "ex_0035", "required_agents": [1, 4, 5, 7], "difficulty": 3, "eval_hint": "SQL + JSON + резюме + стиль", "text": "Получи данные о жалобах клиентов, структурируй их по категориям, составь краткий отчёт для руководства и переформулируй для публикации в блоге компании.", "notes": "SQL для данных, Structured Extraction для категорий, Summarization для отчёта, Rewrite для блога."}
{"id": "ex_0140", "required_agents": [0, 2, 3, 4, 5, 6, 7, 8], "difficulty": 7, "eval_hint": "код + анализ + мат + JSON + резюме + ТЗ + стиль + финансы", "text": "Создай платформу для комплексного анализа эффективности ритейл-сети: реализуй модули сбора данных о продажах, трафике и операционных метриках по всем магазинам, обработай информацию о чеках и товарных остатках, вычисли KPI эффективности каждой точки продаж, примени модели кластеризации для типологии магазинов, структурируй рекомендации по ассортименту и ценообразованию, генерируй автоматические отчёты для регионального менеджмента, составь требования к системе управления категориями, адаптируй дашборды под франчайзи и рассчитай прогноз выручки и маржинальности по форматам.", "notes": "Code для платформы, Data Analysis для чеков, Math для моделей, Structured Extraction для рекомендаций, Summarization для отчётов, Requirements для управления, Rewrite для франчайзи, Finance для прогноза."}
{"id": "ex_0131", "required_agents": [0, 1, 2, 3, 4, 5, 6, 7], "difficulty": 7, "eval_hint": "код + SQL + анализ + мат + JSON + резюме + ТЗ + стиль", "text": "Разработай enterprise-платформу для комплексного управления данными о клиентах: создай модули ETL для консолидации информации из CRM, биллинга, службы поддержки и веб-аналитики, выгружай данные из разнородных баз, реализуй модели сегментации клиентов с использованием кластерного анализа, вычисли lifetime value и склонность к оттоку для каждого сегмента, структурируй персонализированные рекомендации по продуктам, генерируй автоматические отчёты для маркетинга и продаж, составь техническую спецификацию CDP-системы и адаптируй интерфейсы под различные роли пользователей.", "notes": "Code для платформы, SQL для консолидации, Data Analysis для сегментации, Math для моделей, Structured Extraction для рекомендаций, Summarization для отчётов, Requirements для CDP, Rewrite для интерфейсов."}
{"id": "ex_0026", "required_agents": [1, 2, 3], "difficulty": 2, "eval_hint": "SQL + анализ + мат", "text": "Извлеки данные о времени выполнения задач, вычисли статистические показатели и построй модель прогнозирования.", "notes": "SQL для извлечения, Data Analysis для показателей, Math для модели."}
{"id": "ex_0079", "required_agents": [1, 2, 3, 4, 5], "difficulty": 4, "eval_hint": "SQL + анализ + мат + JSON + резюме", "text": "Выполни запрос по логам доступа к системе, проанализируй паттерны использования, вычисли пиковые нагрузки, структурируй отчёт по пользователям и подготовь краткое резюме для администраторов.", "notes": "SQL для запроса, Data Analysis для паттернов, Math для нагрузок, Structured Extraction для отчёта, Summarization для резюме."}
{"id": "ex_0051", "required_agents": [0, 5, 7, 8], "difficulty": 3, "eval_hint": "код + резюме + стиль + финансы", "text": "Реализуй калькулятор для сложных финансовых продуктов, добавь функцию генерации резюме условий, адаптируй интерфейс под разные языки и рассчитай эффективную процентную ставку.", "notes": "Code для калькулятора, Summarization для резюме, Rewrite для языков, Finance для ставки."}
{"id": "ex_0228", "required_agents": [1, 4, 6, 8], "difficulty": 3, "eval_hint": "SQL + JSON + ТЗ + финансы", "text": "Получи данные о договорах лизинга, структурируй графики платежей, составь требования к системе учёта и рассчитай дисконтированную стоимость обязательств.", "notes": "SQL для договоров, Structured Extraction для графиков, Requirements для учёта, Finance для стоимости."}
{"id": "ex_0137", "required_agents": [1, 2, 3, 4, 5, 6, 7, 8], "difficulty": 7, "eval_hint": "SQL + анализ + мат + JSON + резюме + ТЗ + стиль + финансы", "text": "Выгрузи детальные данные о всех страховых договорах и убытках за последние 10 лет, проанализируй частоту и тяжесть страховых случаев по продуктам и регионам, вычисли технические резервы методами chain-ladder и Bornhuetter-Ferguson, структурируй актуарный анализ по линиям бизнеса, подготовь комплексный отчёт для андеррайтинга, составь требования к pricing-моделям с учётом конкурентной среды, адаптируй методологию под требования регулятора и МСФО 17 и рассчитай достаточность капитала по Solvency II.", "notes": "SQL для выгрузки, Data Analysis для убытков, Math для резервов, Structured Extraction для анализа, Summarization для отчёта, Requirements для pricing, Rewrite для МСФО, Finance для капитала."}
{"id": "ex_0215", "required_agents": [1, 4, 5, 8], "difficulty": 3, "eval_hint": "SQL + JSON + резюме + финансы", "text": "Получи данные о структуре кредитного портфеля, извлеки параметры ссуд в структурированный вид, подготовь краткий обзор для кредитного комитета и рассчитай взвешенную процентную ставку.", "notes": "SQL для портфеля, Structured Extraction для параметров, Summarization для обзора, Finance для ставки."}
{"id": "ex_0297", "required_agents": [1, 4, 5, 6, 7, 8], "difficulty": 5, "eval_hint": "SQL + JSON + резюме + ТЗ + стиль + финансы", "text": "Получи данные о структуре капитала компании, извлеки информацию о долговых обязательствах в структурированный вид, подготовь краткий финансовый обзор, составь требования к рефинансированию, адаптируй презентацию для кредиторов и рассчитай стоимость капитала.", "notes": "SQL для данных, Structured Extraction для обязательств, Summarization для обзора, Requirements для рефинансирования, Rewrite для кредиторов, Finance для стоимости."}
{"id": "ex_0216", "required_agents": [0, 2, 4, 6], "difficulty": 3, "eval_hint": "код + анализ + JSON + ТЗ", "text": "Разработай платформу для обработки обратной связи: собирай отзывы из разных источников, анализируй настроения, структурируй категории проблем и составь требования к автоматизации ответов.", "notes": "Code для платформы, Data Analysis для настроений, Structured Extraction для категорий, Requirements для автоматизации."}
{"id": "ex_0034", "required_agents": [0, 3, 5, 8], "difficulty": 3, "eval_hint": "код + мат + резюме + финансы", "text": "Создай модель оценки кредитного риска с использованием численных методов, реализуй расчёт вероятности дефолта и подготовь резюме с финансовыми рекомендациями.", "notes": "Code для модели, Math для методов, Summarization для резюме, Finance для риска."}
{"id": "ex_0204", "required_agents": [1, 6, 7], "difficulty": 2, "eval_hint": "SQL + ТЗ + стиль", "text": "Получи данные о заявках клиентов, составь требования к процессу обработки и адаптируй инструкции для службы поддержки.", "notes": "SQL для заявок, Requirements для процесса, Rewrite для поддержки."}
{"id": "ex_0103", "required_agents": [0, 3, 4, 5, 7, 8], "difficulty": 5, "eval_hint": "код + мат + JSON + резюме + стиль + финансы", "text": "Реализуй симулятор Монте-Карло для оценки инвестиционных рисков, вычисли распределение возможных доходностей, структурируй сценарии, сформируй краткое резюме для инвестиционного комитета, адаптируй его для презентации клиентам и рассчитай Value at Risk.", "notes": "Code для симулятора, Math для Монте-Карло, Structured Extraction для сценариев, Summarization для резюме, Rewrite для клиентов, Finance для VaR."}
{"id": "ex_0090", "required_agents": [1, 2, 3, 4, 7, 8], "difficulty": 5, "eval_hint": "SQL + анализ + мат + JSON + стиль + финансы", "text": "Выгрузи данные о страховых случаях, проанализируй частоту и тяжесть убытков, вычисли резервы по методу chain-ladder, структурируй результаты актуарного анализа, переформулируй выводы для совета директоров и рассчитай достаточность капитала.", "notes": "SQL для выгрузки, Data Analysis для убытков, Math для резервов, Structured Extraction для анализа, Rewrite для совета, Finance для капитала."}
{"id": "ex_0018", "required_agents": [0, 2, 4], "difficulty": 2, "eval_hint": "код + анализ + JSON", "text": "Напиши обработчик лог-файлов, извлеки метрики производительности и представь их в структурированном виде для дальнейшего анализа.", "notes": "Code для обработчика, Data Analysis для метрик, Structured Extraction для структуры."}
{"id": "ex_0129", "required_agents": [0, 2, 4, 5, 6, 7, 8], "difficulty": 6, "eval_hint": "код + анализ + JSON + резюме + ТЗ + стиль + финансы", "text": "Разработай систему для управления дебиторской и кредиторской задолженностью: создай модули автоматического сверки расчётов, обработай данные о платёжной дисциплине контрагентов, структурируй реестры задолженности, генерируй еженедельные саммари для финансового контролёра, составь требования к автоматизации процессов взыскания, адаптируй коммуникацию с должниками под разные сегменты и рассчитай резервы под сомнительные долги.", "notes": "Code для системы, Data Analysis для дисциплины, Structured Extraction для реестров, Summarization для саммари, Requirements для взыскания, Rewrite для коммуникации, Finance для резервов."}
{"id": "ex_0261", "required_agents": [1, 2, 3, 4, 5, 6], "difficulty": 5, "eval_hint": "SQL + анализ + мат + JSON + резюме + ТЗ", "text": "Выгрузи полную историю операций по счетам, проанализируй паттерны использования банковских продуктов, вычисли lifetime value клиентов, структурируй сегменты по доходности, подготовь развёрнутый отчёт для маркетинга и составь требования к персонализированным предложениям.", "notes": "SQL для истории, Data Analysis для паттернов, Math для LTV, Structured Extraction для сегментов, Summarization для отчёта, Requirements для предложений."}
{"id": "ex_0042", "required_agents": [1, 2, 7, 8], "difficulty": 3, "eval_hint": "SQL + анализ + стиль + финансы", "text": "Выгрузи данные о продажах по каналам, проанализируй эффективность каждого канала, рассчитай CAC и LTV, переформулируй выводы для маркетинговой команды.", "notes": "SQL для выгрузки, Data Analysis для эффективности, Finance для CAC/LTV, Rewrite для команды."}
{"id": "ex_0252", "required_agents": [0, 1, 3, 5, 8], "difficulty": 4, "eval_hint": "код + SQL + мат + резюме + финансы", "text": "Разработай систему для трекинга расходов: загружай транзакции из банковских систем, реализуй категоризацию затрат, вычисли статистику по периодам, формируй краткие отчёты и рассчитай отклонения от бюджета.", "notes": "Code для системы, SQL для транзакций, Math для статистики, Summarization для отчётов, Finance для отклонений."}
{"id": "ex_0049", "required_agents": [1, 2, 5, 6], "difficulty": 3, "eval_hint": "SQL + анализ + резюме + ТЗ", "text": "Выполни запрос по клиентской базе, проанализируй сегменты по различным критериям, составь краткий отчёт о находках и сформулируй требования к CRM-системе.", "notes": "SQL для запроса, Data Analysis для сегментов, Summarization для отчёта, Requirements для CRM."}
{"id": "ex_0058", "required_agents": [0, 2, 4, 5], "difficulty": 3, "eval_hint": "код + анализ + JSON + резюме", "text": "Создай систему мониторинга API, собирай метрики производительности, структурируй их для дашборда и генерируй ежедневные саммари о состоянии сервисов.", "notes": "Code для системы, Data Analysis для метрик, Structured Extraction для дашборда, Summarization для саммари."}
{"id": "ex_0145", "required_agents": [0, 1, 2, 3, 4, 5, 6, 7, 8], "difficulty": 8, "eval_hint": "код + SQL + анализ + мат + JSON + резюме + ТЗ + стиль + финансы", "text": "Разработай платформу для управления хедж-фондом: создай модули для разработки и бэктестинга количественных торговых стратегий, интегрируй с поставщиками рыночных данных и execution management systems, реализуй алгоритмы машинного обучения для прогнозирования и генерации сигналов, вычисли портфельную оптимизацию с учётом транзакционных издержек и constraints, проанализируй факторные экспозиции и риски стратегий, примени модели управления рисками включая VaR, stress testing и scenario analysis, структурируй attribution analysis доходности по стратегиям и факторам, генерируй детальные отчёты о performance для инвесторов, составь требования к системам trade execution и risk management, адаптируй investor communications и quarterly letters и рассчитай fee structure, hurdle rate и carried interest с полным P&L attribution.", "notes": "Code для платформы, SQL для данных, Data Analysis для экспозиций, Math для ML и оптимизации, Structured Extraction для attribution, Summarization для отчётов, Requirements для execution, Rewrite для investors, Finance для fee и P&L."}
{"id": "ex_0014", "required_agents": [4, 6, 7], "difficulty": 2, "eval_hint": "JSON + ТЗ + стиль", "text": "Извлеки из описания проекта ключевые параметры в структурированный вид, составь по ним спецификацию и переформулируй её для нетехнической аудитории.", "notes": "Structured Extraction для извлечения, Requirements для спецификации, Rewrite для адаптации."}
{"id": "ex_0057", "required_agents": [3, 4, 7, 8], "difficulty": 3, "eval_hint": "мат + JSON + стиль + финансы", "text": "Реши задачу оптимизации налоговой нагрузки для холдинга, представь схему в структурированном виде, переформулируй для совета директоров и рассчитай экономию.", "notes": "Math для оптимизации, Structured Extraction для схемы, Rewrite для совета, Finance для экономии."}
{"id": "ex_0020", "required_agents": [3, 5, 8], "difficulty": 2, "eval_hint": "мат + резюме + финансы", "text": "Реши задачу линейного программирования для бюджетирования, оформи решение кратко и рассчитай финансовый эффект.", "notes": "Math для задачи, Summarization для краткости, Finance для эффекта."}
{"id": "ex_0281", "required_agents": [0, 1, 2, 4, 6, 7], "difficulty": 5, "eval_hint": "код + SQL + анализ + JSON + ТЗ + стиль", "text": "Создай систему для управления обучением персонала: загружай данные о прохождении курсов, реализуй трекинг прогресса, проанализируй эффективность программ, структурируй персональные планы развития, составь требования к LMS и адаптируй отчёты под HR и сотрудников.", "notes": "Code для системы, SQL для курсов, Data Analysis для программ, Structured Extraction для планов, Requirements для LMS, Rewrite для отчётов."}
{"id": "ex_0172", "required_agents": [3, 4], "difficulty": 1, "eval_hint": "мат + JSON", "text": "Вычисли корни многочлена и представь решение в структурированном виде.", "notes": "Math для корней + Structured Extraction для структуры."}
{"id": "ex_0203", "required_agents": [0, 1, 8], "difficulty": 2, "eval_hint": "код + SQL + финансы", "text": "Разработай модуль для импорта банковских выписок, загружай транзакции в базу и рассчитай баланс по счетам.", "notes": "Code для модуля, SQL для загрузки, Finance для баланса."}
{"id": "ex_0162", "required_agents": [1, 4], "difficulty": 1, "eval_hint": "SQL + JSON", "text": "Выполни запрос для получения структуры таблиц базы данных и представь результат в JSON-формате.", "notes": "SQL для запроса + Structured Extraction для JSON."}
{"id": "ex_0002", "required_agents": [2, 5], "difficulty": 1, "eval_hint": "анализ + саммари", "text": "Проанализируй продажи по регионам за квартал и составь краткое резюме с ключевыми выводами.", "notes": "Data Analysis для расчётов + Summarization для краткого вывода."}
{"id": "ex_0089", "required_agents": [0, 2, 5, 6, 7, 8], "difficulty": 5, "eval_hint": "код + анализ + резюме + ТЗ + стиль + финансы", "text": "Создай калькулятор для оценки недвижимости: реализуй модели сравнительного анализа, обработай данные о сделках, сформируй краткие отчёты по объектам, составь требования к интеграции с кадастром, адаптируй результаты для риелторов и рассчитай инвестиционную привлекательность.", "notes": "Code для калькулятора, Data Analysis для данных, Summarization для отчётов, Requirements для интеграции, Rewrite для риелторов, Finance для привлекательности."}
{"id": "ex_0220", "required_agents": [1, 3, 6, 7], "difficulty": 3, "eval_hint": "SQL + мат + ТЗ + стиль", "text": "Извлеки статистику обращений в техподдержку, вычисли среднее время решения по категориям, составь требования к SLA и адаптируй метрики для клиентского дашборда.", "notes": "SQL для статистики, Math для времени, Requirements для SLA, Rewrite для дашборда."}
{"id": "ex_0303", "required_agents": [0, 2, 3, 4, 5, 6, 7, 8], "difficulty": 7, "eval_hint": "код + анализ + мат + JSON + резюме + ТЗ + стиль + финансы", "text": "Создай платформу для управления performance management в компании: реализуй модули постановки целей и трекинга KPI, обработай данные о достижениях сотрудников, вычисли взвешенные оценки по компетенциям, структурируй индивидуальные планы развития, генерируй персонализированные отчёты для сотрудников и менеджеров, составь требования к калибровке оценок, адаптируй интерфейс под различные роли и рассчитай связь performance с вознаграждением.", "notes": "Code для платформы, Data Analysis для достижений, Math для оценок, Structured Extraction для планов, Summarization для отчётов, Requirements для калибровки, Rewrite для интерфейса, Finance для вознаграждения."}
{"id": "ex_0212", "required_agents": [1, 3, 4, 6], "difficulty": 3, "eval_hint": "SQL + мат + JSON + ТЗ", "text": "Выгрузи данные о нагрузке на сеть, вычисли пропускную способность по узлам, структурируй рекомендации по масштабированию и составь техническое задание на модернизацию.", "notes": "SQL для выгрузки, Math для расчётов, Structured Extraction для рекомендаций, Requirements для ТЗ."}
{"id": "ex_0207", "required_agents": [0, 4, 7], "difficulty": 2, "eval_hint": "код + JSON + стиль", "text": "Создай конвертер между форматами данных, структурируй схему преобразования и адаптируй документацию для пользователей.", "notes": "Code для конвертера, Structured Extraction для схемы, Rewrite для документации."}
{"id": "ex_0093", "required_agents": [0, 3, 4, 5, 6, 8], "difficulty": 5, "eval_hint": "код + мат + JSON + резюме + ТЗ + финансы", "text": "Реализуй модель для оценки кредитоспособности заёмщиков: примени логистическую регрессию, обработай финансовые показатели, структурируй скоринговые карты, создай краткие отчёты по каждому заявителю, составь требования к автоматизации процесса и рассчитай вероятность дефолта.", "notes": "Code для модели, Math для регрессии, Structured Extraction для карт, Summarization для отчётов, Requirements для автоматизации, Finance для дефолта."}
{"id": "ex_0116", "required_agents": [1, 2, 3, 4, 5, 6, 8], "difficulty": 6, "eval_hint": "SQL + анализ + мат + JSON + резюме + ТЗ + финансы", "text": "Выгрузи данные о всех финансовых инструментах в портфеле, проанализируй структуру по классам активов и срочности, вычисли дюрацию и выпуклость для облигационной части, структурируй gap-анализ процентного риска, подготовь комплексный отчёт для ALCO, составь рекомендации по управлению процентным риском и рассчитай чувствительность портфеля к изменению кривой доходности.", "notes": "SQL для выгрузки, Data Analysis для структуры, Math для дюрации, Structured Extraction для gap, Summarization для отчёта, Requirements для рекомендаций, Finance для чувствительности."}
{"id": "set_0003", "required_agents": [0, 4, 5, 6], "difficulty": 3, "eval_hint": "format_check", "text": "Создай техническое задание для системы автоматического парсинга email-уведомлений. ТЗ должно включать: 1) требования к извлечению структурированных данных (имя, email, дата, сумма) в JSON, 2) краткое резюме функциональности в 5 пунктах, 3) пример Python-кода для парсинга одного письма.", "notes": "комбо: Requirements + Extraction + Summary + Code"}
{"id": "ex_0149", "required_agents": [1, 5], "difficulty": 1, "eval_hint": "SQL + резюме", "text": "Выгрузи список топ-10 товаров по количеству продаж и сформируй краткий вывод о лидерах ассортимента.", "notes": "SQL для выгрузки + Summarization для вывода."}
{"id": "ex_0168", "required_agents": [4, 8], "difficulty": 1, "eval_hint": "JSON + финансы", "text": "Извлеки из счёта на оплату номер, сумму и НДС в структурированный формат и посчитай итоговую сумму.", "notes": "Structured Extraction для извлечения + Finance для НДС."}
{"id": "ex_0227", "required_agents": [0, 2, 3, 5], "difficulty": 3, "eval_hint": "код + анализ + мат + резюме", "text": "Напиши программу для анализа временных рядов: загружай данные, примени методы сглаживания, вычисли тренды и составь краткое заключение.", "notes": "Code для программы, Data Analysis для данных, Math для методов, Summarization для заключения."}
{"id": "ex_0230", "required_agents": [2, 5, 6, 7], "difficulty": 3, "eval_hint": "анализ + резюме + ТЗ + стиль", "text": "Изучи данные о работе колл-центра, подготовь краткий отчёт о качестве обслуживания, составь требования к обучению операторов и адаптируй материалы для тренинга.", "notes": "Data Analysis для работы, Summarization для отчёта, Requirements для обучения, Rewrite для тренинга."}
{"id": "ex_0169", "required_agents": [5, 6], "difficulty": 1, "eval_hint": "резюме + ТЗ", "text": "Подготовь краткое описание текущего функционала системы и на его основе составь список требований к следующей версии.", "notes": "Summarization для описания + Requirements для списка."}
{"id": "ex_0158", "required_agents": [4, 7], "difficulty": 1, "eval_hint": "JSON + стиль", "text": "Извлеки контактную информацию из визитки в структурированный вид и переформулируй сопроводительное письмо в формальном тоне.", "notes": "Structured Extraction для контактов + Rewrite для письма."}
{"id": "ex_0205", "required_agents": [2, 4, 8], "difficulty": 2, "eval_hint": "анализ + JSON + финансы", "text": "Проанализируй структуру доходов компании, извлеки ключевые статьи в структурированный вид и рассчитай маржинальность по направлениям.", "notes": "Data Analysis для доходов, Structured Extraction для статей, Finance для маржинальности."}
{"id": "ex_0064", "required_agents": [0, 2, 3, 4, 8], "difficulty": 4, "eval_hint": "код + анализ + мат + JSON + финансы", "text": "Создай модель прогнозирования выручки: реализуй алгоритм машинного обучения, обработай исторические данные, вычисли доверительные интервалы, структурируй прогнозы и рассчитай влияние на денежный поток.", "notes": "Code для модели, Data Analysis для данных, Math для интервалов, Structured Extraction для прогнозов, Finance для денежного потока."}
{"id": "ex_0130", "required_agents": [0, 1, 2, 3, 5, 6, 8], "difficulty": 6, "eval_hint": "код + SQL + анализ + мат + резюме + ТЗ + финансы", "text": "Создай комплексную систему для Treasury management: разработай модули прогнозирования денежных потоков, загружай данные о планируемых поступлениях и платежах из различных источников, реализуй оптимизацию размещения средств, примени математические методы для управления ликвидностью, сформируй краткие отчёты о позиции на каждый день, составь требования к интеграции с банковскими системами и рассчитай стоимость фондирования разрыва ликвидности.", "notes": "Code для системы, SQL для загрузки, Data Analysis для прогнозирования, Math для оптимизации, Summarization для отчётов, Requirements для интеграции, Finance для фондирования."}
{"id": "ex_0132", "required_agents": [0, 2, 3, 4, 5, 6, 7, 8], "difficulty": 7, "eval_hint": "код + анализ + мат + JSON + резюме + ТЗ + стиль + финансы", "text": "Создай систему для комплексного анализа инвестиционного портфеля институционального клиента: реализуй модули оценки всех классов активов от акций до деривативов, обработай рыночные данные и корпоративные действия, вычисли риск-метрики портфеля включая VaR и CVaR, структурируй детализацию по стратегиям и менеджерам, сформируй персонализированные отчёты для клиентов разного уровня, составь требования к системе compliance и мониторинга лимитов, адаптируй презентацию результатов для инвестиционного комитета и рассчитай attribution analysis доходности по факторам.", "notes": "Code для системы, Data Analysis для данных, Math для риск-метрик, Structured Extraction для детализации, Summarization для отчётов, Requirements для compliance, Rewrite для комитета, Finance для attribution."}
{"id": "ex_0138", "required_agents": [0, 1, 2, 3, 4, 6, 7, 8], "difficulty": 7, "eval_hint": "код + SQL + анализ + мат + JSON + ТЗ + стиль + финансы", "text": "Создай платформу для управления программой лояльности: разработай модули начисления и списания бонусов, интегрируй с транзакционными системами и CRM, проанализируй эффективность различных механик программы, вычисли инкрементальность продаж от участия в программе, структурируй сегменты участников по активности, составь требования к персонализации предложений, адаптируй коммуникацию под разные когорты клиентов и рассчитай ROI программы лояльности с учётом полного цикла.", "notes": "Code для платформы, SQL для интеграции, Data Analysis для эффективности, Math для инкрементальности, Structured Extraction для сегментов, Requirements для персонализации, Rewrite для коммуникации, Finance для ROI."}
{"id": "ex_0221", "required_agents": [2, 4, 6, 8], "difficulty": 3, "eval_hint": "анализ + JSON + ТЗ + финансы", "text": "Проанализируй эффективность рекламных каналов, структурируй метрики по кампаниям, составь требования к системе attribution и рассчитай CPA по источникам.", "notes": "Data Analysis для эффективности, Structured Extraction для метрик, Requirements для attribution, Finance для CPA."}
{"id": "ex_0016", "required_agents": [2, 5, 6], "difficulty": 2, "eval_hint": "анализ + резюме + ТЗ", "text": "Изучи данные о пользовательском поведении, выдели основные паттерны, сформулируй требования к улучшению продукта на основе выводов.", "notes": "Data Analysis для паттернов, Summarization для выводов, Requirements для требований."}
{"id": "ex_0264", "required_agents": [1, 2, 3, 5, 6, 7], "difficulty": 5, "eval_hint": "SQL + анализ + мат + резюме + ТЗ + стиль", "text": "Выгрузи данные о производительности call-центра, проанализируй метрики обслуживания, вычисли среднее время обработки звонков, подготовь краткий отчёт для операционного директора, составь требования к обучению персонала и адаптируй KPI для операторов.", "notes": "SQL для выгрузки, Data Analysis для метрик, Math для времени, Summarization для отчёта, Requirements для обучения, Rewrite для операторов."}
{"id": "ex_0083", "required_agents": [1, 2, 3, 5, 7, 8], "difficulty": 5, "eval_hint": "SQL + анализ + мат + резюме + стиль + финансы", "text": "Выгрузи данные о доходности инвестиционных фондов, проанализируй риск-профили, вычисли коэффициенты Шарпа и Сортино, подготовь краткий инвестиционный обзор, адаптируй его для клиентов банка и рассчитай комиссионные доходы.", "notes": "SQL для выгрузки, Data Analysis для профилей, Math для коэффициентов, Summarization для обзора, Rewrite для клиентов, Finance для комиссий."}
{"id": "ex_0222", "required_agents": [0, 1, 5, 7], "difficulty": 3, "eval_hint": "код + SQL + резюме + стиль", "text": "Разработай систему для экспорта данных: реализуй выгрузку в различных форматах, сформируй краткие описания каждого экспорта и адаптируй интерфейс под разные группы пользователей.", "notes": "Code для системы, SQL для выгрузки, Summarization для описаний, Rewrite для групп."}
{"id": "ex_0024", "required_agents": [0, 6, 8], "difficulty": 2, "eval_hint": "код + ТЗ + финансы", "text": "Опиши архитектуру микросервиса для расчёта комиссий, реализуй прототип и добавь функционал расчёта сложных процентов.", "notes": "Requirements для архитектуры, Code для прототипа, Finance для комиссий."}
{"id": "ex_0279", "required_agents": [0, 4, 5, 6, 7, 8], "difficulty": 5, "eval_hint": "код + JSON + резюме + ТЗ + стиль + финансы", "text": "Разработай платформу для управления венчурным портфелем: извлекай данные о стартапах в структурированный вид, генерируй краткие профили компаний, составь требования к процессу due diligence, адаптируй pitch materials для партнёров фонда и рассчитай потенциальный ROI по каждой сделке.", "notes": "Code для платформы, Structured Extraction для данных, Summarization для профилей, Requirements для due diligence, Rewrite для materials, Finance для ROI."}
{"id": "ex_0173", "required_agents": [5, 7], "difficulty": 1, "eval_hint": "резюме + стиль", "text": "Составь краткое резюме технического документа и адаптируй его для маркетинговой брошюры.", "notes": "Summarization для резюме + Rewrite для брошюры."}
{"id": "ex_0183", "required_agents": [2, 4, 7], "difficulty": 2, "eval_hint": "анализ + JSON + стиль", "text": "Обработай результаты маркетингового исследования, структурируй основные находки и адаптируй отчёт для совета директоров.", "notes": "Data Analysis для обработки, Structured Extraction для структуры, Rewrite для совета."}
{"id": "ex_0115", "required_agents": [0, 2, 3, 4, 6, 7, 8], "difficulty": 6, "eval_hint": "код + анализ + мат + JSON + ТЗ + стиль + финансы", "text": "Создай платформу для stress-testing финансовых показателей: реализуй модели сценарного анализа, обработай исторические данные о кризисных периодах, вычисли потенциальные убытки при различных шоках, структурируй результаты по бизнес-линиям, составь требования к процессу регулярного тестирования, адаптируй отчёты для регуляторов и рассчитай необходимый буфер капитала.", "notes": "Code для платформы, Data Analysis для данных, Math для сценариев, Structured Extraction для результатов, Requirements для тестирования, Rewrite для регуляторов, Finance для капитала."}
{"id": "ex_0181", "required_agents": [0, 3, 5], "difficulty": 2, "eval_hint": "код + мат + резюме", "text": "Напиши программу для численного решения дифференциального уравнения, протестируй на примерах и составь краткое описание метода.", "notes": "Code для программы, Math для численного метода, Summarization для описания."}
{"id": "ex_0179", "required_agents": [0, 5], "difficulty": 1, "eval_hint": "код + резюме", "text": "Создай скрипт для генерации отчётов из логов и добавь функцию автоматического резюмирования ошибок.", "notes": "Code для скрипта + Summarization для резюме."}
{"id": "ex_0296", "required_agents": [0, 3, 5, 6, 7, 8], "difficulty": 5, "eval_hint": "код + мат + резюме + ТЗ + стиль + финансы", "text": "Реализуй калькулятор для оценки лизинговых сделок: вычисли эффективную ставку и график платежей, сформируй персонализированные предложения, составь требования к процессу одобрения, адаптируй коммерческие условия для клиентов и рассчитай общую стоимость сделки.", "notes": "Code для калькулятора, Math для расчётов, Summarization для предложений, Requirements для одобрения, Rewrite для условий, Finance для стоимости."}
{"id": "ex_0134", "required_agents": [0, 1, 2, 4, 5, 6, 7, 8], "difficulty": 7, "eval_hint": "код + SQL + анализ + JSON + резюме + ТЗ + стиль + финансы", "text": "Разработай платформу для управления производственным планированием и учётом затрат: создай модули для сбора данных с производственного оборудования, интегрируй с ERP для получения информации о заказах и материалах, проанализируй эффективность использования мощностей, структурируй план-факт анализ по продуктам и подразделениям, генерируй ежедневные отчёты о выполнении производственной программы, составь спецификацию интеграции с системами MES, адаптируй отчётность под требования управленческого учёта и рассчитай полную себестоимость продукции с распределением накладных расходов.", "notes": "Code для платформы, SQL для интеграции, Data Analysis для эффективности, Structured Extraction для анализа, Summarization для отчётов, Requirements для MES, Rewrite для учёта, Finance для себестоимости."}
{"id": "ex_0086", "required_agents": [0, 2, 3, 5, 6, 7], "difficulty": 5, "eval_hint": "код + анализ + мат + резюме + ТЗ + стиль", "text": "Создай систему прогнозирования спроса на товары: реализуй модели временных рядов, обработай исторические продажи, вычисли сезонность и тренды, сформируй краткие прогнозы по категориям, составь требования к интеграции с системой закупок и адаптируй отчёты для закупщиков.", "notes": "Code для системы, Data Analysis для продаж, Math для моделей, Summarization для прогнозов, Requirements для интеграции, Rewrite для закупщиков."}
{"id": "ex_0087", "required_agents": [1, 3, 4, 5, 7, 8], "difficulty": 5, "eval_hint": "SQL + мат + JSON + резюме + стиль + финансы", "text": "Извлеки портфель ценных бумаг клиентов, вычисли параметры распределения доходностей, структурируй рекомендации по ребалансировке, подготовь краткий отчёт для wealth management, адаптируй его для клиентской рассылки и рассчитай налоговые последствия сделок.", "notes": "SQL для портфеля, Math для распределений, Structured Extraction для рекомендаций, Summarization для отчёта, Rewrite для рассылки, Finance для налогов."}
{"id": "ex_0114", "required_agents": [0, 1, 4, 5, 6, 7, 8], "difficulty": 6, "eval_hint": "код + SQL + JSON + резюме + ТЗ + стиль + финансы", "text": "Разработай систему автоматизации кредитного конвейера: создай API для приёма заявок, интегрируй с базами данных бюро кредитных историй, извлекай структурированную информацию о заёмщиках, генерируй краткие резюме по каждой заявке, составь спецификацию автоматического скоринга, адаптируй правила андеррайтинга под разные продукты и реализуй расчёт процентных ставок с учётом рисков.", "notes": "Code для системы, SQL для интеграции, Structured Extraction для информации, Summarization для резюме, Requirements для скоринга, Rewrite для продуктов, Finance для ставок."}
{"id": "ex_0073", "required_agents": [2, 4, 5, 7, 8], "difficulty": 4, "eval_hint": "анализ + JSON + резюме + стиль + финансы", "text": "Обработай данные о структуре затрат компании, извлеки ключевые статьи расходов в структурированный вид, подготовь краткое резюме для CFO, адаптируй его для годового отчёта акционерам и рассчитай маржинальность.", "notes": "Data Analysis для обработки, Structured Extraction для статей, Summarization для резюме, Rewrite для отчёта, Finance для маржинальности."}
{"id": "ex_0274", "required_agents": [0, 1, 5, 6, 7, 8], "difficulty": 5, "eval_hint": "код + SQL + резюме + ТЗ + стиль + финансы", "text": "Создай систему для автоматизации финансовой отчётности: реализуй модули консолидации данных, загружай информацию из учётных систем, генерируй отчёты по МСФО, составь требования к процессу закрытия периода, адаптируй формат под аудиторов и рассчитай ключевые финансовые коэффициенты.", "notes": "Code для системы, SQL для систем, Summarization для отчётов, Requirements для закрытия, Rewrite для аудиторов, Finance для коэффициентов."}
{"id": "ex_0091", "required_agents": [0, 1, 4, 5, 6, 7], "difficulty": 5, "eval_hint": "код + SQL + JSON + резюме + ТЗ + стиль", "text": "Разработай систему для обработки заявок клиентов: создай API для приёма запросов, сохраняй их в базу, извлекай структурированные данные, генерируй автоматические ответы, составь спецификацию интеграции с CRM и адаптируй шаблоны писем под разные сегменты клиентов.", "notes": "Code для API, SQL для сохранения, Structured Extraction для данных, Summarization для ответов, Requirements для интеграции, Rewrite для шаблонов."}
{"id": "ex_0031", "required_agents": [0, 4, 6, 7], "difficulty": 3, "eval_hint": "код + JSON + ТЗ + стиль", "text": "Разработай конвертер документов, извлекай метаданные в структурированный формат, составь техническое описание и адаптируй его для пользовательской документации.", "notes": "Code для конвертера, Structured Extraction для метаданных, Requirements для описания, Rewrite для документации."}
{"id": "ex_0292", "required_agents": [2, 3, 4, 6, 7, 8], "difficulty": 5, "eval_hint": "анализ + мат + JSON + ТЗ + стиль + финансы", "text": "Проанализируй эффективность использования складских площадей: обработай данные о запасах и оборачиваемости, вычисли оптимальные уровни складирования, структурируй рекомендации по логистике, составь требования к WMS, адаптируй инструкции для складского персонала и рассчитай стоимость хранения.", "notes": "Data Analysis для запасов, Math для уровней, Structured Extraction для рекомендаций, Requirements для WMS, Rewrite для инструкций, Finance для стоимости."}
{"id": "ex_0251", "required_agents": [1, 4, 5, 6, 7], "difficulty": 4, "eval_hint": "SQL + JSON + резюме + ТЗ + стиль", "text": "Получи данные о жалобах клиентов из системы, структурируй их по категориям, подготовь краткие саммари для руководства, составь требования к улучшению процессов и адаптируй рекомендации для операционной команды.", "notes": "SQL для жалоб, Structured Extraction для категорий, Summarization для саммари, Requirements для улучшения, Rewrite для команды."}
{"id": "ex_0226", "required_agents": [3, 5, 7, 8], "difficulty": 3, "eval_hint": "мат + резюме + стиль + финансы", "text": "Вычисли параметры кредитной линии с учётом залога, подготовь краткое резюме условий, адаптируй его для клиента и рассчитай эффективную ставку.", "notes": "Math для параметров, Summarization для резюме, Rewrite для клиента, Finance для ставки."}
{"id": "ex_0015", "required_agents": [0, 3, 8], "difficulty": 2, "eval_hint": "код + мат + финансы", "text": "Реализуй калькулятор для расчёта IRR по произвольным денежным потокам, используй численные методы.", "notes": "Code для реализации, Math для численных методов, Finance для IRR."}
{"id": "ex_0048", "required_agents": [0, 1, 3, 4], "difficulty": 3, "eval_hint": "код + SQL + мат + JSON", "text": "Создай систему для анализа временных рядов: загружай данные из базы, применяй методы декомпозиции, структурируй прогнозы и выводи в стандартном формате.", "notes": "Code для системы, SQL для загрузки, Math для декомпозиции, Structured Extraction для вывода."}
{"id": "ex_0233", "required_agents": [3, 4, 6, 7], "difficulty": 3, "eval_hint": "мат + JSON + ТЗ + стиль", "text": "Реши задачу на построение модели роста популяции, структурируй прогнозы, составь требования к симулятору и адаптируй описание для биологов.", "notes": "Math для модели, Structured Extraction для прогнозов, Requirements для симулятора, Rewrite для биологов."}
{"id": "ex_0197", "required_agents": [0, 3, 4], "difficulty": 2, "eval_hint": "код + мат + JSON", "text": "Реализуй решение системы нелинейных уравнений численным методом и выведи результаты в структурированном виде.", "notes": "Code для решения, Math для метода, Structured Extraction для вывода."}
{"id": "ex_0166", "required_agents": [1, 6], "difficulty": 1, "eval_hint": "SQL + ТЗ", "text": "Получи список пользователей с их ролями и составь требования к системе управления доступом.", "notes": "SQL для списка + Requirements для управления."}
{"id": "ex_0054", "required_agents": [1, 4, 5, 8], "difficulty": 3, "eval_hint": "SQL + JSON + резюме + финансы", "text": "Получи данные о расходах по проектам, структурируй их по статьям затрат, подготовь краткий отчёт для бюджетного комитета и рассчитай отклонения от плана.", "notes": "SQL для данных, Structured Extraction для статей, Summarization для отчёта, Finance для отклонений."}
{"id": "ex_0307", "required_agents": [0, 2, 3, 4, 5, 6, 7, 8], "difficulty": 7, "eval_hint": "код + анализ + мат + JSON + резюме + ТЗ + стиль + финансы", "text": "Разработай платформу для комплексного анализа supply chain: реализуй модули сбора данных о всех этапах цепочки поставок, обработай информацию о поставщиках, запасах, производстве и логистике, вычисли оптимальные уровни запасов и точки перезаказа, примени методы прогнозирования спроса, структурируй рекомендации по оптимизации процессов, генерируй KPI-отчёты для операционного руководства, составь требования к интеграции с ERP и WMS, адаптируй дашборды под различные звенья цепочки и рассчитай total cost of ownership.", "notes": "Code для платформы, Data Analysis для цепочки, Math для прогнозирования, Structured Extraction для рекомендаций, Summarization для отчётов, Requirements для интеграции, Rewrite для дашбордов, Finance для TCO."}
{"id": "ex_0315", "required_agents": [0, 2, 3, 4, 5, 6, 7, 8], "difficulty": 7, "eval_hint": "код + анализ + мат + JSON + резюме + ТЗ + стиль + финансы", "text": "Разработай платформу для управления healthcare analytics: реализуй модули сбора клинических данных и показателей качества медпомощи, обработай информацию о пациентах и treatment outcomes, вычисли cost-effectiveness различных протоколов лечения, примени predictive analytics для прогнозирования рисков, структурируй clinical pathways и best practices, генерируй отчёты для медперсонала и администрации, составь требования к интеграции с EMR, адаптируй reporting под регуляторные требования и рассчитай стоимость treatment per patient.", "notes": "Code для платформы, Data Analysis для outcomes, Math для predictive analytics, Structured Extraction для pathways, Summarization для отчётов, Requirements для EMR, Rewrite для регуляторов, Finance для стоимости."}
{"id": "ex_0070", "required_agents": [0, 4, 5, 6, 7], "difficulty": 4, "eval_hint": "код + JSON + резюме + ТЗ + стиль", "text": "Разработай конвертер для миграции данных между CRM-системами, извлекай записи в стандартный формат, генерируй отчёты о проблемах, составь инструкцию по использованию и адаптируй её для технической поддержки.", "notes": "Code для конвертера, Structured Extraction для формата, Summarization для отчётов, Requirements для инструкции, Rewrite для поддержки."}
{"id": "ex_0025", "required_agents": [3, 4, 6], "difficulty": 2, "eval_hint": "мат + JSON + ТЗ", "text": "Реши систему уравнений для балансировки нагрузки, представь решение в структурированном виде и составь рекомендации по настройке.", "notes": "Math для решения, Structured Extraction для структуры, Requirements для рекомендаций."}
{"id": "ex_0063", "required_agents": [0, 1, 2, 5, 6], "difficulty": 4, "eval_hint": "код + SQL + анализ + резюме + ТЗ", "text": "Разработай платформу для сбора обратной связи: создай скрипты загрузки из базы, проанализируй тональность отзывов, сформируй краткие инсайты и составь требования к автоматизации обработки.", "notes": "Code для платформы, SQL для загрузки, Data Analysis для тональности, Summarization для инсайтов, Requirements для автоматизации."}
{"id": "ex_0123", "required_agents": [0, 1, 2, 4, 6, 7, 8], "difficulty": 6, "eval_hint": "код + SQL + анализ + JSON + ТЗ + стиль + финансы", "text": "Разработай платформу для управления проектным портфелем: создай модули планирования и трекинга задач, загружай данные о ресурсах и бюджетах из корпоративных систем, анализируй отклонения от планов, структурируй статусы проектов для PMO, составь требования к интеграции с системами учёта рабочего времени, адаптируй отчёты под разные уровни управления и рассчитай финансовую эффективность каждого проекта.", "notes": "Code для платформы, SQL для загрузки, Data Analysis для отклонений, Structured Extraction для статусов, Requirements для интеграции, Rewrite для уровней, Finance для эффективности."}
{"id": "ex_0156", "required_agents": [2, 4], "difficulty": 1, "eval_hint": "анализ + JSON", "text": "Обработай данные опроса пользователей, посчитай распределение ответов и представь результаты в структурированном формате.", "notes": "Data Analysis для обработки + Structured Extraction для формата."}
{"id": "ex_0301", "required_agents": [0, 1, 2, 3, 4, 5, 6, 7], "difficulty": 7, "eval_hint": "код + SQL + анализ + мат + JSON + резюме + ТЗ + стиль", "text": "Создай комплексную платформу для управления клиентским опытом: разработай модули сбора обратной связи из всех точек контакта, загружай данные о взаимодействиях из CRM и поддержки, реализуй NLP-анализ отзывов и определение тональности, вычисли индексы удовлетворённости по сегментам, структурируй категории проблем и opportunities, генерируй персонализированные отчёты для разных департаментов, составь требования к процессу улучшения CX и адаптируй коммуникацию под различные уровни организации.", "notes": "Code для платформы, SQL для данных, Data Analysis для NLP, Math для индексов, Structured Extraction для категорий, Summarization для отчётов, Requirements для CX, Rewrite для коммуникации."}
{"id": "ex_0109", "required_agents": [0, 2, 4, 5, 6, 8], "difficulty": 5, "eval_hint": "код + анализ + JSON + резюме + ТЗ + финансы", "text": "Разработай платформу для управления подписками: создай модуль обработки платежей, проанализируй метрики churn и retention, структурируй когорты пользователей, сформируй краткие инсайты, составь требования к программе лояльности и рассчитай customer lifetime value.", "notes": "Code для платформы, Data Analysis для churn, Structured Extraction для когорт, Summarization для инсайтов, Requirements для лояльности, Finance для LTV."}
{"id": "ex_0309", "required_agents": [0, 1, 2, 3, 5, 6, 7, 8], "difficulty": 7, "eval_hint": "код + SQL + анализ + мат + резюме + ТЗ + стиль + финансы", "text": "Создай платформу для управления M&A процессом: разработай модули для скрининга потенциальных целей, загружай финансовую информацию из различных источников, реализуй модели оценки DCF с multiple scenarios, вычисли синергии и accretion/dilution анализ, проанализируй риски интеграции, сформируй pitch materials и investment memos, составь требования к due diligence процессу, адаптируй презентации для board и shareholders и рассчитай ROIC сделки.", "notes": "Code для платформы, SQL для информации, Data Analysis для рисков, Math для DCF, Summarization для memos, Requirements для due diligence, Rewrite для презентаций, Finance для ROIC."}
{"id": "ex_0150", "required_agents": [2, 8], "difficulty": 1, "eval_hint": "анализ + финансы", "text": "Посчитай среднюю выручку по месяцам из таблицы и определи сезонность, затем оцени влияние на годовую прибыль.", "notes": "Data Analysis для расчётов + Finance для прибыли."}
{"id": "ex_0153", "required_agents": [5, 7], "difficulty": 1, "eval_hint": "резюме + стиль", "text": "Подготовь краткое резюме встречи по проекту и переформулируй его для отправки в рассылке клиентам.", "notes": "Summarization для резюме + Rewrite для клиентов."}
{"id": "ex_0122", "required_agents": [1, 3, 4, 5, 6, 7, 8], "difficulty": 6, "eval_hint": "SQL + мат + JSON + резюме + ТЗ + стиль + финансы", "text": "Выгрузи данные о структуре затрат производственного предприятия, вычисли себестоимость продукции по методу ABC-costing, структурируй распределение накладных расходов по центрам затрат, подготовь детальный отчёт для финансового директора, составь рекомендации по оптимизации издержек, адаптируй их для презентации собственникам и рассчитай влияние предлагаемых мер на операционную прибыль.", "notes": "SQL для выгрузки, Math для ABC-costing, Structured Extraction для распределения, Summarization для отчёта, Requirements для рекомендаций, Rewrite для собственников, Finance для прибыли."}
{"id": "ex_0133", "required_agents": [1, 2, 3, 4, 5, 6, 7, 8], "difficulty": 7, "eval_hint": "SQL + анализ + мат + JSON + резюме + ТЗ + стиль + финансы", "text": "Выгрузи полную историю операций корпоративных клиентов банка за 5 лет, проанализируй транзакционное поведение и выдели кластеры по характеру бизнеса, вычисли показатели кредитного качества и вероятности дефолта с использованием логистической регрессии и ML-моделей, структурируй рейтинги заёмщиков по отраслям, подготовь комплексный аналитический отчёт для кредитного комитета, составь требования к автоматизации процесса андеррайтинга, адаптируй методологию оценки под требования регулятора и рассчитай необходимые резервы под ожидаемые кредитные убытки по IFRS 9.", "notes": "SQL для истории, Data Analysis для кластеров, Math для моделей, Structured Extraction для рейтингов, Summarization для отчёта, Requirements для андеррайтинга, Rewrite для регулятора, Finance для резервов."}
{"id": "ex_0257", "required_agents": [2, 3, 5, 6, 7], "difficulty": 4, "eval_hint": "анализ + мат + резюме + ТЗ + стиль", "text": "Обработай данные опроса удовлетворённости клиентов, вычисли индекс NPS, подготовь краткое резюме результатов, составь требования к улучшению сервиса и адаптируй план действий для команды.", "notes": "Data Analysis для опроса, Math для NPS, Summarization для резюме, Requirements для улучшения, Rewrite для плана."}
{"id": "ex_0041", "required_agents": [0, 4, 5, 6], "difficulty": 3, "eval_hint": "код + JSON + резюме + ТЗ", "text": "Создай парсер API-ответов, извлекай данные в структурированный формат, генерируй краткие саммари для каждого запроса и составь спецификацию интеграции.", "notes": "Code для парсера, Structured Extraction для формата, Summarization для саммари, Requirements для спецификации."}
{"id": "ex_0092", "required_agents": [2, 3, 4, 6, 7, 8], "difficulty": 5, "eval_hint": "анализ + мат + JSON + ТЗ + стиль + финансы", "text": "Проанализируй эффективность маркетинговых каналов: обработай данные о расходах и привлечении клиентов, вычисли атрибуционные модели, структурируй рекомендации по распределению бюджета, составь план маркетинговой стратегии, адаптируй его для презентации CMO и рассчитай прогнозируемый ROMI.", "notes": "Data Analysis для каналов, Math для атрибуции, Structured Extraction для рекомендаций, Requirements для плана, Rewrite для презентации, Finance для ROMI."}
{"id": "ex_0139", "required_agents": [0, 1, 2, 3, 5, 6, 7, 8], "difficulty": 7, "eval_hint": "код + SQL + анализ + мат + резюме + ТЗ + стиль + финансы", "text": "Разработай систему для автоматизации процесса ICAAP в банке: создай модули для расчёта капитала под все виды рисков, загружай данные из систем управления рисками и финансового учёта, реализуй модели стресс-тестирования макроэкономических сценариев, вычисли достаточность капитала в базовом и стрессовом сценариях, сформируй комплексный отчёт о достаточности капитала для регулятора, составь внутреннюю методологию оценки капитала, адаптируй презентацию результатов для совета директоров и рассчитай буферы капитала с учётом риск-аппетита.", "notes": "Code для системы, SQL для загрузки, Data Analysis для рисков, Math для стресс-тестов, Summarization для отчёта, Requirements для методологии, Rewrite для совета, Finance для буферов."}
{"id": "ex_0188", "required_agents": [4, 6, 8], "difficulty": 2, "eval_hint": "JSON + ТЗ + финансы", "text": "Извлеки условия кредитного договора в структурированный вид, составь требования к системе мониторинга и рассчитай полную стоимость кредита.", "notes": "Structured Extraction для условий, Requirements для мониторинга, Finance для стоимости."}
{"id": "ex_0033", "required_agents": [2, 4, 6, 8], "difficulty": 3, "eval_hint": "анализ + JSON + ТЗ + финансы", "text": "Проанализируй когорты пользователей, извлеки ключевые сегменты в структурированный вид, составь требования к таргетированным кампаниям и рассчитай ожидаемый ROI.", "notes": "Data Analysis для когорт, Structured Extraction для сегментов, Requirements для кампаний, Finance для ROI."}
{"id": "ex_0191", "required_agents": [1, 5, 8], "difficulty": 2, "eval_hint": "SQL + резюме + финансы", "text": "Выгрузи историю платежей, подготовь краткий отчёт о задолженности и рассчитай штрафы за просрочку.", "notes": "SQL для истории, Summarization для отчёта, Finance для штрафов."}
{"id": "ex_0199", "required_agents": [0, 5, 8], "difficulty": 2, "eval_hint": "код + резюме + финансы", "text": "Создай калькулятор для расчёта амортизации, добавь функцию генерации отчёта и рассчитай остаточную стоимость.", "notes": "Code для калькулятора, Summarization для отчёта, Finance для амортизации."}
{"id": "ex_0305", "required_agents": [0, 1, 2, 4, 5, 6, 7, 8], "difficulty": 7, "eval_hint": "код + SQL + анализ + JSON + резюме + ТЗ + стиль + финансы", "text": "Разработай платформу для управления Treasury в международной группе: создай модули прогнозирования cash flow по всем юрлицам и валютам, загружай данные из банковских систем и ERP, реализуй оптимизацию размещения ликвидности, проанализируй валютные риски, структурируй хедж-стратегии, генерируй ежедневные отчёты о позиции для казначейства, составь требования к интеграции с банками, адаптируй reporting под требования головной компании и рассчитай стоимость фондирования и FX exposure.", "notes": "Code для платформы, SQL для данных, Data Analysis для рисков, Structured Extraction для стратегий, Summarization для отчётов, Requirements для интеграции, Rewrite для reporting, Finance для фондирования."}
{"id": "ex_0289", "required_agents": [0, 3, 4, 5, 6, 8], "difficulty": 5, "eval_hint": "код + мат + JSON + резюме + ТЗ + финансы", "text": "Создай модель для оценки эффективности маркетинговых каналов: реализуй многоканальную атрибуцию, вычисли вклад каждого touchpoint, структурируй customer journey, сформируй краткие рекомендации по бюджету, составь требования к системе аналитики и рассчитай прогнозируемый ROAS.", "notes": "Code для модели, Math для атрибуции, Structured Extraction для journey, Summarization для рекомендаций, Requirements для аналитики, Finance для ROAS."}
{"id": "ex_0107", "required_agents": [0, 1, 3, 5, 6, 7], "difficulty": 5, "eval_hint": "код + SQL + мат + резюме + ТЗ + стиль", "text": "Создай систему для анализа производительности сотрудников: реализуй модели оценки эффективности, загружай данные о выполненных задачах из базы, вычисли рейтинги по подразделениям, сформируй краткие отчёты для менеджеров, составь требования к системе мотивации и адаптируй презентацию для HR-департамента.", "notes": "Code для системы, SQL для задач, Math для рейтингов, Summarization для отчётов, Requirements для мотивации, Rewrite для HR."}
{"id": "ex_0187", "required_agents": [2, 5, 6], "difficulty": 2, "eval_hint": "анализ + резюме + ТЗ", "text": "Изучи обратную связь от клиентов, выдели ключевые проблемы, составь краткий отчёт и сформулируй требования к улучшениям.", "notes": "Data Analysis для проблем, Summarization для отчёта, Requirements для улучшений."}
{"id": "ex_0017", "required_agents": [1, 3, 4], "difficulty": 2, "eval_hint": "SQL + мат + JSON", "text": "Получи статистику по транзакциям, вычисли медиану и квартили, оформи результат в структурированном формате.", "notes": "SQL для статистики, Math для вычислений, Structured Extraction для формата."}
{"id": "ex_0060", "required_agents": [0, 3, 5, 6], "difficulty": 3, "eval_hint": "код + мат + резюме + ТЗ", "text": "Реализуй решатель для задач линейного программирования, добавь визуализацию результатов, составь краткое руководство пользователя и опиши требования к входным данным.", "notes": "Code для решателя, Math для задач, Summarization для руководства, Requirements для данных."}
{"id": "ex_0246", "required_agents": [0, 4, 5, 6, 7], "difficulty": 4, "eval_hint": "код + JSON + резюме + ТЗ + стиль", "text": "Разработай систему для управления документооборотом: извлекай метаданные файлов в структурированный вид, генерируй краткие описания документов, составь требования к версионированию и адаптируй интерфейс для разных отделов.", "notes": "Code для системы, Structured Extraction для метаданных, Summarization для описаний, Requirements для версионирования, Rewrite для отделов."}
{"id": "ex_0099", "required_agents": [2, 3, 5, 6, 7, 8], "difficulty": 5, "eval_hint": "анализ + мат + резюме + ТЗ + стиль + финансы", "text": "Проанализируй эффективность процессов кредитования: обработай данные по заявкам и одобрениям, вычисли конверсию на каждом этапе воронки, подготовь краткие выводы для кредитного комитета, составь требования к автоматизации скоринга, адаптируй рекомендации для IT-департамента и рассчитай влияние на доходность портфеля.", "notes": "Data Analysis для процессов, Math для конверсии, Summarization для выводов, Requirements для автоматизации, Rewrite для IT, Finance для доходности."}
{"id": "ex_0275", "required_agents": [0, 3, 5, 6, 7, 8], "difficulty": 5, "eval_hint": "код + мат + резюме + ТЗ + стиль + финансы", "text": "Реализуй модель для оценки стоимости компании методом DCF: вычисли дисконтированные денежные потоки, примени различные сценарии роста, сформируй краткое резюме оценки, составь требования к процессу валюации, адаптируй отчёт для инвесторов и рассчитай терминальную стоимость.", "notes": "Code для модели, Math для DCF, Summarization для резюме, Requirements для валюации, Rewrite для инвесторов, Finance для стоимости."}
{"id": "ex_0110", "required_agents": [1, 3, 4, 5, 7, 8], "difficulty": 5, "eval_hint": "SQL + мат + JSON + резюме + стиль + финансы", "text": "Извлеки данные о депозитном портфеле, вычисли эффективные процентные ставки с учётом капитализации, структурируй анализ по срочности, подготовь краткий обзор для казначейства, адаптируй его для презентации правлению и рассчитай стоимость фондирования.", "notes": "SQL для портфеля, Math для ставок, Structured Extraction для анализа, Summarization для обзора, Rewrite для правления, Finance для фондирования."}
{"id": "ex_0053", "required_agents": [0, 2, 3, 6], "difficulty": 3, "eval_hint": "код + анализ + мат + ТЗ", "text": "Напиши модуль для обработки сенсорных данных, проанализируй шумы и выбросы, примени фильтрацию и составь спецификацию калибровки оборудования.", "notes": "Code для модуля, Data Analysis для выбросов, Math для фильтрации, Requirements для калибровки."}
{"id": "ex_0160", "required_agents": [6, 7], "difficulty": 1, "eval_hint": "ТЗ + стиль", "text": "Составь требования к дизайну мобильного приложения и адаптируй их для презентации дизайнерам.", "notes": "Requirements для дизайна + Rewrite для дизайнеров."}
{"id": "ex_0300", "required_agents": [0, 1, 4, 5, 6, 7], "difficulty": 5, "eval_hint": "код + SQL + JSON + резюме + ТЗ + стиль", "text": "Разработай систему для управления контентом: создай модули для публикации материалов, загружай метаданные из базы, извлекай ключевую информацию в структурированный вид, генерируй краткие анонсы, составь требования к модерации и адаптируй интерфейс для редакторов и авторов.", "notes": "Code для системы, SQL для метаданных, Structured Extraction для информации, Summarization для анонсов, Requirements для модерации, Rewrite для интерфейса."}
{"id": "ex_0161", "required_agents": [0, 7], "difficulty": 1, "eval_hint": "код + стиль", "text": "Напиши функцию форматирования дат и добавь возможность вывода в разных локалях.", "notes": "Code для функции + Rewrite для локалей."}
{"id": "ex_0104", "required_agents": [1, 3, 5, 6, 7, 8], "difficulty": 5, "eval_hint": "SQL + мат + резюме + ТЗ + стиль + финансы", "text": "Извлеки данные о валютных операциях, вычисли эффективные курсы и спреды, подготовь краткий отчёт о валютной позиции, составь требования к хеджированию рисков, адаптируй рекомендации для казначейства и рассчитай потенциальные валютные убытки.", "notes": "SQL для операций, Math для курсов, Summarization для отчёта, Requirements для хеджирования, Rewrite для казначейства, Finance для убытков."}
{"id": "ex_0272", "required_agents": [0, 2, 4, 5, 6, 7], "difficulty": 5, "eval_hint": "код + анализ + JSON + резюме + ТЗ + стиль", "text": "Разработай платформу для управления техническим долгом: создай модули для трекинга задач рефакторинга, проанализируй критичность проблем, структурируй приоритеты, генерируй краткие статус-репорты для CTO, составь требования к процессу планирования и адаптируй roadmap для команды разработки.", "notes": "Code для платформы, Data Analysis для критичности, Structured Extraction для приоритетов, Summarization для репортов, Requirements для планирования, Rewrite для roadmap."}
